[
  {
    "url": "https://www.rottentomatoes.com/tv/survive/s01/",
    "title": "Survive: Season 1 - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Real Quick We want to hear what you have to say but need to verify your email. Don’t worry, it won’t take long. Please click the link below to receive your verification email. We want to hear what you have to say but need to verify your account. Just leave us a message and we will work on getting you verified. Please reference “Error Code 2121” when contacting customer service. > > Season 1 Survive: Season 1 (2020) Season 1 Survive Critics Consensus Though Survive struggles under the weight of its subject matter and limited runtime, it's further proof that the incredibly talented Sophie Turner is worthy of bigger, better roles. TOMATOMETER Critic Ratings: 26 Audience Score User Ratings: 16 TOMATOMETER Average Rating: Avg Rating: /10 Total Count: Fresh: Rotten: The percentage of Approved Tomatometer Critics who have given this movie a positive review AUDIENCE SCORE 69% Average Rating: Avg Rating: 3.8/5 Total Count: 16 The percentage of users who rated this 3.5 stars or higher. Super Reviewer Verified Super Reviewer Verified Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) Super Reviewer Step 2 of 2 How did you buy your ticket? Let's get your review verified. By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You're almost there! Just confirm how you got your ticket. Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) How did you buy your ticket? By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You haven’t finished your review yet, want to submit as-is? You can always edit your review after. Are you sure? Verified reviews are considered more trustworthy by fellow moviegoers. Want to submit changes to your review before closing? Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. The image is an example of a ticket confirmation email that AMC sent you when you purchased your ticket. Your Ticket Confirmation # is located under the header in your email that reads \"Your Ticket Reservation Details\". Just below that it reads \"Ticket Confirmation#:\" followed by a 10-digit number. This 10-digit number is your confirmation number. Your AMC Ticket Confirmation# can be found in your order confirmation email. Episodes Air date: Apr 6, 2020 Tv Season Info Genre: Mystery & Suspense Network: QUIBI Premiere Date: Apr 6, 2020 Cast News & Interviews for Survive: Season 1 Episodes Air date: Apr 6, 2020 | | | Sophie Turner takes the lead in a tonally uncertain drama about young people's mental health, set in a psychiatric facility called Lifehouse, equipped with landscaped gardens, a palatial pharmacy, and a \"feelings doctor just for you.\" Apr 10, 2020 | Top Critic Turner is good, as his her fellow survivor (Corey Hawkins), but so much time is spent before the crash even occurs that it's a slow, redundant introduction, and Turner's voice-over doesn't help. May 13, 2020 | Sophie Turner gives a performance which fluctuates between unhinged and placidly rational on a dime. Her voice over is reminiscent of Fight Club in the matter of fact delivery, classification of mental disorder and character introductions. May 13, 2020 | Rating: 5/5 | It's the technical aspect of [It] that impresses the most. But while Turner and Hawkins are engaging performers, and the production design presents some horrific scenarios for their characters, there's something a little shallow about the entire premise. May 13, 2020 | Rating: 3/5 | Turner is a bit stiff here, and her American accent is shaky, but she and co-star (and fellow plane crash survivor) Corey Hawkins work well together as they traverse the harsh wilderness. May 13, 2020 | Survive showcases some very melodramatic moments of acting that often feels like a drama class exercise. Still, having only seen the first four chapters, it's possible Survive improves in future chapters now that all the emotional set-up is out of the way May 13, 2020 | Rating: 6/10 | The show's treatment of mental illness is reductive to the point of almost romanticizing suicidal ideation as a kind of Kurt Cobain-esque beautiful pain that reflects how we should truly see the world. May 13, 2020 | Suicide haunts compelling, cliffhanger-heavy survival show. Apr 23, 2020 | Rating: 4/5 | There are some nice moments of cinematography throughout but overall this is a decent story told in an unconventional manner. Still, if you are shelling out for Quibi, you could do worse than spending ten minutes each day seeing where this story goes. Apr 13, 2020 | Rating: 7/10 | It's essentially The Mountain Between Us for a younger set, only more concerned with depression and suicide, and is an odd fit for Quibi's limited dimensions. Apr 6, 2020 | As much as Survive escapes becoming completely melodramatic thanks to nuanced performances, there's a disconnect between the characters and the story at hand, often leaning more on its visuals-and Quibi's distribution method hinders its connection. Apr 6, 2020 | Rating: 2.5/5 | One way or the other, I'd like to bet the pairing of Turner and Hawkins will continue to make Survive an engaging, entertaining watch as we get more installments. Apr 6, 2020 | Rating: 3/5 | Audience Reviews for Survive: Season 1 Apr 23, 2020 I'm the type of person who applauds something new and creative, regardless of whether it works or not. For that reason alone, I was very intrigued by the new streaming service by the name of Quibi. Made solely to be viewed through mobile devices and in any aspect ratio of your choosing, it makes for a fun experience. Now, the main issue I was also foreseeing was the fact that this format may become distracting if the subject matter was possibly too well-made to be viewed here. Well, I've made it through one of their first pieces of content in Survive, and if that any indication of how the rest of their shows are, I'll gladly continue watching. Jane, a troubled young woman, finds herself at a very dark place in her life when the plane she's on goes down. For her, this is pretty much a wake-up call, as she and Paul are the only survivors. Fighting for their lives to escape the wilderness, this story never stops moving. Told in 10-minute segments or less over the course of 12 episodes, Survive basically feels like a film that has been chopped up in order to feel like a short television series. This format definitely won't work for every story that will be on this service, that's for sure, but this particular story worked fairly well. Still, I would've preferred watching this as an uninterrupted movie, even though that probably would've put an accent on its flaws. Survive is hellbent on keeping you on the edge of your seat, so much so the point that every time you start an episode, you expect brief character moments, an incident that places them both in danger, and then a cliffhanger that will bring you back for the next 10 minutes. This format worked, due to the fact that it kept me hooked, but this was clearly made in the same way a feature film is made. If this movie hit theatres, it would've felt very repetitive. Watching characters continuously getting themselves into danger every 5–10 minutes probably wouldn't have worked for everyone. Even though Survive does also get bogged down with some melodrama and goes a little over-the-top in certain areas, I found myself compelled for the majority of it, and that was absolutely due to the commitment by both Sophie Turner and Corey Hawkins. This is easily one of Turner's best performances, even though her dialogue is pretty conventional at times and Hawkins plays off her very well. Yes, due to some of the dialogue, their chemistry felt a little forced, but they were both giving it their all. By the end, I found myself attached to both of them and choosing to brush off some of the bad or cliched dialogue. Overall, even though I haven't had the chance to check out other offerings on the Quibi streaming service, Survive proves to me that they aren't just trying to be a new fad. They're going for some solid storytelling and even though I have issues with this particular story, it was still a good series, which I'll just choose to call an uneven film. It was in good hands in front of and being the lens and it really goes show as a final product. Is it a must-watch, no, but the service is absolutely worth checking out and Survive is worth your time, since it's not very long. Super Reviewer 9h ago I won't be continuing my Quibi subscription. Thanks. 4d ago Sophie Turner does a pretty good job in a less superhero and more dramatic good role but the small running time and definitely the story could and should have been better. (5/10) 6d ago I have both talked to suicidal people and seen a young woman commit suicide by jumping off the 8th interior mezzanine floor above me, as I was working glass panels put up to prevent jumpers. I discovered later, she was just 18 yo, seeing her twice, once the day before in an attempted jump from her chosen point, then being stopped by security, then taken away by paramedics on a gurney and hospitalised. She was was strikingly beautiful, looked as if she had nothing in her future to fear, yet she returned, a little earlier than the day before, beating the regular security shift. I learned later she was an arm and leg cutter clearly in a constant state of trauma. Sophie Turner evoked just the right visual look, body language, therefore, mindset to suspend my belief in any other character I had observed her portray. Sophie Turner is destined to keep this career, if she chooses, for a lifetime playing quality roles. I found the whole piece totally legitimate, in exploring all the emotions these disasters evoke in the human psyche. Both Corey Hawkins and Laurel Marsden deserve a mention, as they played exceptional parts also. Apr 24, 2020 Best show on Quibi. With all episodes released, will be hard to put down. Apr 24, 2020 Outstanding performance by Sophie Turner. Takes you into the depths of a disturbed young girl's mental health battle, as she tries to navigate a whipsaw of emotions. Faced with an insurmountable feat while fighting the temptation of suicidal ideation, Jane delivers a riveting on screen act each episode that has you on your seat living and breathing through every moment. This is a dark subject matter not easily or readily portrayed on tv today. Criticized by those who don't understand the true subtleties and expression of mental illness. Definitely worth a watch - even simply for the breathtaking cinematography. Apr 23, 2020 Simply Riveting. Have the patience to watch it through. it does start a bit slow. Apr 07, 2020 The brand-new streaming service Quibi launched yesterday with several shows, with three episodes available each. The point of this streaming platform was to give episodes in little bites, with each \"chapter\" being around six to ten minutes long, easy to watch on the go. The first show I will be reviewing of theirs is the Sophie Turner-starring survival story Survive which tells the story of a woman named Jane who is having suicidal thoughts and is planning to kill herself on a plane. However, when the plane crashes, her and a kind man named Paul (Corey Hawkins) are left to survive in the wilderness. Turner, as expected, gives a strong performance as the depressed Jane, who is having a tough dilemma whether to end it all or not. After Game of Thrones finally ended, Turner was looking for new roles, playing Jean Grey in Dark Phoenix, but that didn't get her far. So she's now with Survive, and the talented actress gives it everything she's got, but the show gets lost too often in its own cliches. Also, the quick-bite episodes clocking at around seven minutes don't help either, with the actual excitement not starting until the fourth episode. Hawkins gives a strong performance as well, but that still can't help this middling survival drama. It still may be enough to fulfill Turner fans' desires to see her in more TV however. News & Features TOP HEADLINES – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes Opening Top Box Office Coming Soon Top DVD & Streaming New On DVD/Streaming This Week New TV Tonight Most Popular TV on RT Certified Fresh TV About Tomatometer The percentage of Approved Tomatometer Critics who have given this movie a positive review About Audience Score The percentage of users who rated this 3.5 stars or higher. Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/user/id/797126952/",
    "title": "User Profile - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Super Reviewer About No user info supplied. Want-to-See Movies Rating History (2015) Keith L false (2014) Keith L false (2019) Keith L false (2010) Keith L false (2016) Keith L false Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/tv/run/s01/",
    "title": "Run: Season 1 - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Real Quick We want to hear what you have to say but need to verify your email. Don’t worry, it won’t take long. Please click the link below to receive your verification email. We want to hear what you have to say but need to verify your account. Just leave us a message and we will work on getting you verified. Please reference “Error Code 2121” when contacting customer service. > > Season 1 Run: Season 1 (2020) Season 1 Run Critics Consensus Though it can't always sustain its frenetic pace, Run's sharp subversions of romcom clichés are never less than entertaining thanks to Merritt Wever and Domhnall Gleeson's electrifying performances. TOMATOMETER Critic Ratings: 47 Audience Score User Ratings: 70 TOMATOMETER Average Rating: Avg Rating: /10 Total Count: Fresh: Rotten: The percentage of Approved Tomatometer Critics who have given this movie a positive review AUDIENCE SCORE 51% Average Rating: Avg Rating: 3.1/5 Total Count: 70 The percentage of users who rated this 3.5 stars or higher. Super Reviewer Verified Super Reviewer Verified Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) Super Reviewer Step 2 of 2 How did you buy your ticket? Let's get your review verified. By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You're almost there! Just confirm how you got your ticket. Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) How did you buy your ticket? By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You haven’t finished your review yet, want to submit as-is? You can always edit your review after. Are you sure? Verified reviews are considered more trustworthy by fellow moviegoers. Want to submit changes to your review before closing? Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. The image is an example of a ticket confirmation email that AMC sent you when you purchased your ticket. Your Ticket Confirmation # is located under the header in your email that reads \"Your Ticket Reservation Details\". Just below that it reads \"Ticket Confirmation#:\" followed by a 10-digit number. This 10-digit number is your confirmation number. Your AMC Ticket Confirmation# can be found in your order confirmation email. Episodes Air date: Apr 12, 2020 Series premiere. On a Tuesday morning, Ruby Richardson is shaken out of her humdrum suburban life when she receives an urgent text that prompts her to fly to New York and board a cross-country train, where she reunites with college ex Billy Johnson. As their adventure begins, Ruby and Billy fight the tension that still exists between them while attempting to root out each other's secrets. Air date: Apr 19, 2020 On their first night aboard, Ruby's mind is consumed by sex, as Billy probes for personal details she's reluctant to give up. Determined to make Billy jealous, Ruby brazenly connects with a stranger on the train. Air date: Apr 26, 2020 Ruby and Billy decide to spend a day in Chicago before making any rash decisions about their next moves. As the two anxiously await check-in at a lavish hotel, Ruby meets an exciting woman at a department store, while Billy tries to handle a relentless Fiona. Later, Billy comes clean about what drove him to run. Air date: May 3, 2020 Back on the train, Ruby seeks guidance from a new friend and gets a wakeup call from home that leaves her shaken. Meanwhile, Billy continues to lie about Fiona, who raises the stakes to get what she wants. Air date: May 10, 2020 A dramatic detour finds Ruby and Billy in unknown territory as they're forced to make a life-changing decision. As Ruby tries to keep everything together and get back on course, she and an emotional Billy seek the help of an amiable local taxidermist, Laurel. Air date: May 17, 2020 Stranded in the middle of nowhere, Ruby and Billy argue about what to do next. Each affected by the other's desperation, the two must come together to confront their actions. Meanwhile, Laurel makes a gruesome discovery, and receives an eventful visit from Det. Babe Cloud. Air date: May 24, 2020 Season 1 finale. With the end of their journey approaching, Ruby and Billy consider their future together. Meanwhile, Babe and Laurel are forced together as they follow a new lead. Tv Season Info Genre: Comedy Network: HBO Premiere Date: Apr 12, 2020 Creator: Exec. Producers: , , , , , Cast as Babe Cloud News & Interviews for Run: Season 1 Episodes Air date: Apr 12, 2020 Series premiere. On a Tuesday morning, Ruby Richardson is shaken out of her humdrum suburban life when she receives an urgent text that prompts her to fly to New York and board a cross-country train, where she reunites with college ex Billy Johnson. As their adventure begins, Ruby and Billy fight the tension that still exists between them while attempting to root out each other's secrets. Air date: Apr 19, 2020 On their first night aboard, Ruby's mind is consumed by sex, as Billy probes for personal details she's reluctant to give up. Determined to make Billy jealous, Ruby brazenly connects with a stranger on the train. Air date: Apr 26, 2020 Ruby and Billy decide to spend a day in Chicago before making any rash decisions about their next moves. As the two anxiously await check-in at a lavish hotel, Ruby meets an exciting woman at a department store, while Billy tries to handle a relentless Fiona. Later, Billy comes clean about what drove him to run. Air date: May 3, 2020 Back on the train, Ruby seeks guidance from a new friend and gets a wakeup call from home that leaves her shaken. Meanwhile, Billy continues to lie about Fiona, who raises the stakes to get what she wants. Air date: May 10, 2020 A dramatic detour finds Ruby and Billy in unknown territory as they're forced to make a life-changing decision. As Ruby tries to keep everything together and get back on course, she and an emotional Billy seek the help of an amiable local taxidermist, Laurel. Air date: May 17, 2020 Stranded in the middle of nowhere, Ruby and Billy argue about what to do next. Each affected by the other's desperation, the two must come together to confront their actions. Meanwhile, Laurel makes a gruesome discovery, and receives an eventful visit from Det. Babe Cloud. Air date: May 24, 2020 Season 1 finale. With the end of their journey approaching, Ruby and Billy consider their future together. Meanwhile, Babe and Laurel are forced together as they follow a new lead. | | | The execution, as it's carried out by Wever, Gleeson and showrunner Vicky Jones, is smartly, bracingly small. Grounded. Precise. Detailed. Real. That contrast is why HBO's Run is the best new show of 2020. Apr 14, 2020 | Top Critic By the time you hit the fifth of its eight episodes you may find yourself yelling at the screen in amazed delight. Apr 11, 2020 | Rating: A | Top Critic Run is a unique amalgamation of genres and moods, never quite settling in, constantly switching tracks. Apr 10, 2020 | Top Critic It's unfortunate that the fast-paced urgency that pulls you in at the beginning of the series is also what causes it to slightly unravel. But despite this, Run is an undeniably entertaining series. Apr 8, 2020 | Top Critic The best of Run has that razor-sharp wit that made Waller-Bridge famous, but it's really the work by Wever and Gleeson that elevates it into a must-watch. Apr 8, 2020 | Top Critic Building their romantic foundation is key to keeping this momentum-at-all-costs train on the tracks, and even though that should've happened right away, there's still time to get it right. Mar 30, 2020 | Rating: B- | Top Critic Run is pure escapism; a fun, Hitchcockian style thriller full of twists and turns. May 14, 2020 | Rating: 3.5/5 | With Run, Jones uses the female gaze to pay homage to the classics while still telling a fresh, contemporary story. Watch it for the love, the comedy, and the adventure. May 4, 2020 | This is not a classic (in any sense) happy-ending romance, but as the script is by one of Phoebe Waller-Bridge's frequent collaborators, Vicky Jones, there's tension, dark humor and quirky left turns ahead. Apr 30, 2020 | Language, crackling sexual tension in fun escapist thriller. Apr 23, 2020 | Rating: 4/5 | Run doesn't stop being a pleasant and at times inspired mix of romantic comedy and thriller. [Full Review in Spanish] Apr 23, 2020 | Rating: 3.5/5 | If wanting to love a thing were the same as loving it, I could tell you that Run, with its talented cast and crew and buzzworthy premise, is HBO's next must-watch series. Apr 22, 2020 | Audience Reviews for Run: Season 1 16h ago Two leads were miscast, with no sexual chemistry. Faced paced but ultimately, dull. 4d ago Hope it doesn't get nominated for Emmys. Truly undeserving of that. 5d ago I hope that someone out there decides to make something more twisted and authentic about relationships and marriage than this. This felt like a cheesy soap that tried to be dark and witty. Not understanding marriage or relationships. 5d ago Not sure why the marks are so high on this one. Maybe the critics didn't watch post episode 1? In any case, it was a great episode 1 and then, well then it became silly. Everything felt cartoonish and not authentic. I like Fleabag and I LOVE Killing Eve, but this was truly a disappointment after a while. 5d ago This show started off strong and then becomes mediocre. It could dive so much deeper into male and female relationship stories. Rather than these fake talking points and quips. The creator should understand what marriage and relationships are and why they fall apart. This is told from a perspective who clearly doesn't. 5d ago There are better stories out there to tell about women wanting to leave their marriage. This ain't it. 5d ago Run started off strong and then become mediocre. It's sad that after episode 2 everything feels like a schtick, rather than something authentic. 6d ago I made a Rotten Tomatoes account just to review Run. I saw that critics liked it, but audiences? Not so much. I wanted to add my voice to the audiences and advocate for Run because it is downright incredible. It's a thrillingly creative show, based from a classic sort of romantic idea. But the performances are so juicy and the writing is sneakily clever. It's like Collateral meets Before Sunrise. Or, more aptly, it's like Fleabag meets Killing Eve. Easily my favorite new show of 2020. I love, love, love it and can't wait to see where it goes next! 6d ago The worst show HBO show I can remember in a long, long time. Everything from top to bottom is awful. Acting, actor chemistry, pacing, script, plot ... nothing makes sense. Truly a shame because this show should have been great. It's an interesting idea and has a great cast, or so I would have thought. Somehow the execution missed the mark by a mile. May 10, 2020 I really loved this show. The way that the story has been developed it's been really catchy, you want to keep watching episode after episode. Can't wait to see where is it going. And also Merritt Wever and Domhnall Gleeson are really crushing on their performance, they have an excellent chemistry working together, what makes the show even better! You must watch News & Features TOP HEADLINES – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes Opening Top Box Office Coming Soon Top DVD & Streaming New On DVD/Streaming This Week New TV Tonight Most Popular TV on RT Certified Fresh TV About Tomatometer The percentage of Approved Tomatometer Critics who have given this movie a positive review About Audience Score The percentage of users who rated this 3.5 stars or higher. Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/m/blood_and_money/",
    "title": "Blood and Money (2020) - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Real Quick We want to hear what you have to say but need to verify your email. Don’t worry, it won’t take long. Please click the link below to receive your verification email. We want to hear what you have to say but need to verify your account. Just leave us a message and we will work on getting you verified. Please reference “Error Code 2121” when contacting customer service. Opening Top Box Office Coming Soon Top DVD & Streaming New On DVD/Streaming This Week New TV Tonight Most Popular TV on RT Certified Fresh TV Blood and Money Critics Consensus No consensus yet. TOMATOMETER Total Count: 17 Coming soon Release date: May 15, 2020 Audience Score Ratings: Not yet available Blood and Money Ratings & Reviews Explanation Where to watch Rate And Review Super Reviewer Verified Super Reviewer Verified Super Reviewer Rate this movie Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of the movie? (optional) You're almost there! Just confirm how you got your ticket. Super Reviewer Step 2 of 2 How did you buy your ticket? Let's get your review verified. Fandango AMCTheatres.com or AMC AppNew Enter your Ticket Confirmation# located in your email. Cinemark Coming Soon We won’t be able to verify your ticket today, but it’s great to know for the future. Regal Coming Soon We won’t be able to verify your ticket today, but it’s great to know for the future. Theater box office or somewhere else By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You're almost there! Just confirm how you got your ticket. Super Reviewer Rate this movie Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of the movie? (optional) How did you buy your ticket? Fandango AMCTheatres.com or AMC AppNew Enter your Ticket Confirmation# located in your email. Cinemark Coming Soon We won’t be able to verify your ticket today, but it’s great to know for the future. Regal Coming Soon We won’t be able to verify your ticket today, but it’s great to know for the future. Theater box office or somewhere else By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You haven’t finished your review yet, want to submit as-is? You can always edit your review after. Are you sure? Verified reviews are considered more trustworthy by fellow moviegoers. Want to submit changes to your review before closing? Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. The image is an example of a ticket confirmation email that AMC sent you when you purchased your ticket. Your Ticket Confirmation # is located under the header in your email that reads \"Your Ticket Reservation Details\". Just below that it reads \"Ticket Confirmation#:\" followed by a 10-digit number. This 10-digit number is your confirmation number. Your AMC Ticket Confirmation# can be found in your order confirmation email. Blood and Money Videos Blood and Money Photos Movie Info A retired veteran (Tom Berenger) hunting in the Allagash backcountry of Maine discovers a dead woman with a duffle bag full of money. He soon finds himself in a web of deceit and murder. Rating: NR Genre: Action & Adventure, Mystery & Suspense Directed By: Written By: , , In Theaters: May 15, 2020 limited On Disc/Streaming: May 15, 2020 Runtime: 89 minutes Cast as Jane as Debbie as Ray as Bill as Jim Reed as Skip as Cas as George as Jason as Frank as News Anchor as Night Guard as Bartender as Logging Supervisor Critic Reviews for Blood and Money | | | The film has just enough wasted potential to be a near-miss. May 15, 2020 | Rating: 2.5/4 | Top Critic It's man vs. nature, himself, clichés, and a horrible script in this anemic thriller that pits a worthy Tom Berenger against some genuinely god-awful storytelling. May 15, 2020 | Rating: 1.5/5 | Top Critic A welcome vehicle for its star, who has been underused by filmmakers for decades. May 15, 2020 | Top Critic As derivative as its title and as implacable as its declining hero, \"Blood and Money\" suffers from near-calamitous narrative lapses. May 14, 2020 | Top Critic Its conclusion can only inspire a halfhearted shrug... May 16, 2020 | The \"old Rambo\" formula, aided by beautiful location shooting in eastern Maine, works and Berenger keeps it real. May 15, 2020 | Rating: B | While this thriller effectively evokes its chilly Maine setting, its lethargic story feels like a collection of familiar scenes slapped together in the right order that somehow fail to work together. May 15, 2020 | Rating: 2/5 | BLOOD AND MONEY isn't going to change your world. It's a familiar story, and it doesn't quite add anything new to this kind of cat and mouse feature. Yet Tom Berenger gives a solid show as a man placed in an impossible situation. May 15, 2020 | Rating: 7/10 | Unfortunately, the \"thriller\" part is totally predictable and it's not at all difficult to figure out how all of this is going to end. There is one last twist in the final second that does play well. May 14, 2020 | What could have been a very taut thriller is marred by a couple of major writing flaws. May 14, 2020 | Proves to be a rather anemic thriller that, apart from the setting, is a terribly familiar cat-and-mouse chase. May 14, 2020 | Rating: C- | Berenger gives a finely tuned performance that elevates Blood and Money beyond a typical pulp revenge thriller. May 14, 2020 | Audience Reviews for Blood and Money There are no featured audience reviews for Blood and Money at this time. Blood and Money Quotes There are no approved quotes yet for this movie. Movie & TV guides TOP HEADLINES – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes About Tomatometer The percentage of Approved Tomatometer Critics who have given this movie a positive review About Audience Score The percentage of users who rated this 3.5 stars or higher. Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/source-1682/",
    "title": "Common Sense Media - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Common Sense Media Tomatometer-approved publication Rating Title/Year Author Quote 1 3/5 (2005) Posted May 15, 2020 2 3/5 (1999) Posted May 15, 2020 3 4/5 (2000) Posted May 15, 2020 4 3/5 (2002) Posted May 15, 2020 5 2/5 (2003) Posted May 15, 2020 6 3/5 (1999) Posted May 15, 2020 7 3/5 (1998) Posted May 15, 2020 8 4/5 (2017) Posted May 15, 2020 9 2/5 () Posted May 15, 2020 10 3/5 (2019) Posted May 15, 2020 11 3/5 (2019) Posted May 15, 2020 12 3/5 (1967) Posted May 15, 2020 13 2/5 (2020) Posted May 15, 2020 14 3/5 (2019) Posted May 15, 2020 15 3/5 (1998) Posted May 15, 2020 16 4/5 (2020) Posted May 15, 2020 17 3/5 (2006) Posted May 15, 2020 18 3/5 () Posted May 15, 2020 19 4/5 (2013) Posted May 15, 2020 20 3/5 (2020) Posted May 15, 2020 21 3/5 (2020) Posted May 15, 2020 22 3/5 (2019) Posted May 15, 2020 23 4/5 (2020) Posted May 15, 2020 24 2/5 (2020) Posted May 15, 2020 25 4/5 (2019) Posted May 15, 2020 26 1/5 (2020) Posted May 15, 2020 27 3/5 (2019) Posted May 15, 2020 28 3/5 (2019) Posted May 15, 2020 29 2/5 (2020) Posted May 15, 2020 30 4/5 (2019) Posted May 15, 2020 31 3/5 (2011) Posted May 14, 2020 32 2/5 (2019) Posted May 8, 2020 33 1/5 (2016) Posted May 8, 2020 34 2/5 (2019) Posted May 8, 2020 35 2/5 (2018) Posted May 8, 2020 36 3/5 (2018) Posted May 8, 2020 37 3/5 (2020) Posted May 8, 2020 38 2/5 (2012) Posted May 7, 2020 39 2/5 (2017) Posted May 7, 2020 40 3/5 (2020) Posted May 7, 2020 41 4/5 (2020) Posted May 7, 2020 42 2/5 (2020) Posted May 7, 2020 43 2/5 (2018) Posted May 7, 2020 44 4/5 (2017) Posted May 7, 2020 45 4/5 (2020) Posted May 7, 2020 46 1/5 (2019) Posted May 7, 2020 47 3/5 (2019) Posted May 7, 2020 48 2/5 () Posted May 7, 2020 49 2/5 (2020) Posted May 7, 2020 50 2/5 (2020) Posted May 7, 2020 Authors • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/tv/run/",
    "title": "Run - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Run (2020 - ) Run 83% Average Tomatometer Avg Tomatometer 51% Average Audience Score Avg Audience Score Avg Tomatometer A series gets an Average Tomatometer when at least 50 percent of its seasons have a score. The Average Tomatometer is the sum of all season scores divided by the number of seasons with a Tomatometer. Avg Audience Score 51% The percentage of users who rated this 3.5 stars or higher. Series Info A woman's life is turned upside down when she receives a text from her college sweetheart inviting her to drop everything and meet him in New York to fulfill the pact they made 17 years earlier. Creator: Starring: , , Most Recent Episode Aired Sun, May 10, 2020 Run: Season 1, Episode 5 Next Episode Sun, May 17, 2020 Run: Season 1, Episode 6 Run Photos Seasons 83% Critics Consensus: Though it can't always sustain its frenetic pace, Run's sharp subversions of romcom clichés are never less than entertaining thanks to Merritt Wever and Domhnall Gleeson's electrifying performances. 2020, HBO, 8 episodes Cast as Babe Cloud Series Details TV Network: HBO Premiere Date: Genre: Comedy Executive Producers: , , , , , Quick Links About Tomatometer A series gets an Average Tomatometer when at least 50 percent of its seasons have a score. The Average Tomatometer is the sum of all season scores divided by the number of seasons with a Tomatometer. About Audience Score The percentage of users who rated this 3.5 stars or higher. Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/source-3587/",
    "title": "We Have a Hulk - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address We Have a Hulk We Have a Hulk is not a Tomatometer-approved publication. Reviews from this publication only count toward the Tomatometer® when written by the following Tomatometer-approved critic(s): Rating Title/Year Author Quote 1 4.5/5 (2020) Posted May 4, 2020 2 4/5 (2019) Posted May 1, 2020 3 4/5 (2020) Posted Apr 22, 2020 4 3/5 (2019) Posted Mar 25, 2020 5 5/5 (2020) Posted Mar 4, 2020 6 3/5 (2020) Posted Feb 16, 2020 7 5/5 (2019) Posted Feb 9, 2020 8 4/5 (2020) Posted Feb 5, 2020 9 4/5 (2019) Posted Jan 26, 2020 10 3.5/5 (2019) Posted Jan 20, 2020 11 3.5/5 (2019) Posted Jan 2, 2020 12 5/5 (2019) Posted Dec 31, 2019 13 5/5 (2019) Posted Dec 30, 2019 14 3.5/5 (2019) Posted Dec 29, 2019 15 3.5/5 (2019) Posted Dec 10, 2019 16 3/5 (2019) Posted Nov 21, 2019 17 4/5 (2019) Posted Nov 18, 2019 18 5/5 (2019) Posted Nov 13, 2019 19 3/5 (2019) Posted Nov 11, 2019 20 4/5 (2019) Posted Nov 4, 2019 21 5/5 (2019) Posted Oct 16, 2019 22 4/5 (2019) Posted Oct 12, 2019 23 4/5 (2019) Posted Sep 18, 2019 24 4/5 (2019) Posted Sep 15, 2019 25 3.5/5 (2019) Posted Sep 6, 2019 26 3.5/5 (2019) Posted Sep 6, 2019 27 3/5 (2019) Posted Sep 5, 2019 Authors • Go back"
  },
  {
    "url": "https://www.rottentomatoes.com?ratingsType=tv",
    "title": "Rotten Tomatoes: Movies | TV Shows | Movie Trailers | Reviews - Rotten Tomatoes",
    "description": "Trending on RT Must-see videos The freshest trailers, news, reviews, and interviews 0:30 First Look: See Cynthia Erivo as Aretha Franklin in 'Genius' First Look: See Cynthia Erivo as Aretha Franklin in 'Genius' Must-see videos The freshest trailers, news, reviews, and interviews FEATURED FEATURED FEATURED FEATURED FEATURED FEATURED FEATURED FEATURED FEATURED FEATURED News & features Great Asian-American Movies Happy Asian Pacific American Heritage Month Top Streaming Movies | | | | Most Popular TV on RT New TV Tonight Certified Fresh Picks Movies and TV shows are Certified Fresh with a steady Tomatometer of 75% or higher after a set amount of reviews (80 for wide-release movies, 40 for limited-release movies, 20 for TV shows), including 5 reviews from Top Critics. Trailers & Videos Movie & TV guides Top Headlines – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes"
  },
  {
    "url": "https://editorial.rottentomatoes.com/guide/best-netflix-movies-to-watch-right-now/",
    "title": "  250 Best Movies on Netflix Right Now (May 2020) << Rotten Tomatoes – Movie and TV News",
    "description": "Follow Us Trending on RT (Photo by Netflix/courtesy Everett Collection. Thumbnail: Universal/courtesy Everett Collection.) 250 Best Movies on Netflix Right Now, Ranked by Tomatometer Last updated on May 1, 2020 In our world of massive entertainment options, who’s got time to waste on the below-average? You’ve got a subscription, you’re ready for a marathon, and you want only the best movies no Netflix to watch. With thousands of choices on the platform, both original and studio acquired, we’ve found the 250 top Netflix movies, using our critic-approved Tomatometer to guide us! You’ll quickly notice that none of the films featured here fall below 86% on the Tomatometer (with each score tallied from at least 20 reviews), meaning the overwhelming majority of critics who saw these gave them a favorable Fresh review. These movies run the gamut, from widely-seen popular movies (Indiana Jones and the Last Crusade, Ex Machina, Moon) to arthouse hits (Snowpiercer, Pan’s Labyrinth). The movies are by turns funny (Always Be My Maybe, Monty Python and the Holy Grail), sad (Marriage Story, Her), and romantic (Blue Valentine, The Spectacular Now). They’re the scariest horror movies out there (The Witch, Train to Busan), and the best documentaries ever made (13th, Fyre). The best of the new movie highlights include: Django Unchained, Quentin Tarantino’s blood-soaked revenge epic. Back to the Future, the ultimate feel-good time-traveling blockbuster. The Willoughbys, Netflix’s charming original animated movie for the whole family. And we’ve only just scratched the surface of Netflix’s growing stable of formidable originals, like El Camino: A Breaking Bad Movie, Martin Scorsese’s The Irishman, Alfonso Cuaron’s Roma, and Eddie Murphy comeback vehicle Dolemite Is My Name. We’ll update the list as more critical hits arrive onto Netflix, and, of course, when they flee off into the murky ether. Time to get comfy on the couch because we’re not just throwing good movies on Netflix at you, not even just great ones, but the 250 Best Movies on Netflix Right Now, Ranked by Tomatometer! Read More: #250 (2018) 86% #250 Adjusted Score: 87.69% Critics Consensus: Led by an outstanding central performance from Mary Elizabeth Winstead and brilliantly held together by writer-director Eva Vives, All About Nina is a delightfully raw dramedy. Synopsis: Just as Nina Geld's (Mary Elizabeth Winstead) brilliant and angry stand-up kicks her career into high gear, her romantic life... Starring: , , , Directed By: #249 (2019) 87% #249 Adjusted Score: 88.943% Critics Consensus: The Boy Who Harnessed the Wind earns its predictably uplifting arc through strong performances and impressive work from debuting director Chiwetel Ejiofor. Synopsis: Against all the odds, a thirteen year old boy in Malawi invents an unconventional way to save his family and... Starring: , , , Directed By: #248 (1999) 86% #248 Adjusted Score: 87.877% Critics Consensus: Robert Altman's gift for diffuse storytelling is employed to breezily enjoyable effect in Cookie's Fortune, a mirthful caper that layers on a generous helping of Southern charm. Synopsis: The ingredients of an archetypal southern town (the blues, catfish, and scrabble), a deliciously chosen cast, and the creative skills... Starring: , , , Directed By: #247 (2016) 86% #247 Adjusted Score: 89.402% Critics Consensus: The Autopsy of Jane Doe subverts the gruesome expectations triggered by its title to deliver a smart, suggestively creepy thriller that bolsters director André Ovredal's growing reputation. Synopsis: It's just another night at the morgue for a father (Brian Cox) and son (Emile Hirsch) team of coroners, until... Starring: , , , Directed By: #246 (2005) 86% #246 Adjusted Score: 90.216% Critics Consensus: Aided and abetted by a wonderful cast, director Phil Morrison transforms familiar material into an understated and resonant comedy. Synopsis: A dealer in outsider art threatens the equilibrium of her middle-class in-laws in North Carolina. Madeline is a go-getting art... Starring: , , , Directed By: #245 (2012) 86% #245 Adjusted Score: 91.647% Critics Consensus: The Perks of Being a Wallflower is a heartfelt and sincere adaptation that's bolstered by strong lead performances. Synopsis: Based on the best-selling novel by Stephen Chbosky, The Perks of Being a Wallflower is a modern classic that captures... Starring: , , , Directed By: #244 (2017) 86% #244 Adjusted Score: 95.374% Critics Consensus: Okja sees Bong Joon-ho continuing to create defiantly eclectic entertainment -- and still hitting more than enough of his narrative targets in the midst of a tricky tonal juggling act. Synopsis: For 10 idyllic years, young Mija (An Seo Hyun) has been caretaker and constant companion to Okja--a massive animal and... Starring: , , , Directed By: #243 (2018) 87% #243 Adjusted Score: 87.463% Critics Consensus: Uncommonly restrained for a movie about a flesh-eating menace, Ravenous offers a satisfyingly nuanced entry in the crowded zombie apocalypse subgenre. Synopsis: A group of people transform into zombies in a small Canadian town. Labeled the \"hungry,\" they feast upon their loved... Starring: , , , Directed By: #242 (1988) 87% #242 Adjusted Score: 90.878% Critics Consensus: The Naked Gun is chock full of gags that are goofy, unapologetically crass, and ultimately hilarious. Synopsis: Seeking vengeance when his partner (Simpson) is shot full of holes by drug dealers, Lt. Frank Drebin searches for the... Starring: , , , Directed By: #241 (2017) 87% #241 Adjusted Score: 89.167% Critics Consensus: First They Killed My Father tackles its subject matter with grace, skill, and empathy, offering a ground-level look at historic atrocities that resonates beyond its story's borders. Synopsis: Angelina Jolie directed this biopic about a human rights activist and her attempts to survive during the oppressive Khmer Rouge... Starring: , , , Directed By: #240 (2018) 87% #240 Adjusted Score: 89.21% Critics Consensus: Mountain offers a visually thrilling -- and surprisingly affecting -- look at man's relationship with some of Earth's most imposing natural wonders. Synopsis: Only three centuries ago, setting out to climb a mountain would have been considered close to lunacy. Mountains were places... Starring: Directed By: #239 (2019) 87% #239 Adjusted Score: 89.667% Critics Consensus: Stocked with solid performances, Freaks is a clever sci-fi/horror hybrid that suggests a bright future for co-writers/co-directors Zach Lipovsky and Adam Stein. Synopsis: Kept locked inside the house by her father, 7-year-old Chloe lives in fear and fascination of the outside world, where... Starring: , , , Directed By: #238 (2011) 87% #238 Adjusted Score: 88.135% Critics Consensus: No consensus yet. Synopsis: TAMBIEN LA LLUVIA sets up an intriguing dialogue about Spanish imperialism through incidents taking place some 500 years apart, while... Starring: , , , Directed By: #237 (1997) 87% #237 Adjusted Score: 92.126% Critics Consensus: Chasing Amy explores gender roles, sexual mores, and the limits of friendship with a mixture of sensitivity, raw honesty, and director/screenwriter Kevin Smith's signature raunchy humor. Synopsis: After a pair of films about hipster slackers, the work of writer-director Kevin Smith matured and gained critical respect with... Starring: , , , Directed By: #236 (1999) 87% #236 Adjusted Score: 93.705% Critics Consensus: Thanks to the Wachowskis' imaginative vision, The Matrix is a smartly crafted combination of spectacular action and groundbreaking special effects. Synopsis: What if virtual reality wasn't just for fun, but was being used to imprison you? That's the dilemma that faces... Starring: , , , Directed By: , #235 (1999) 87% #235 Adjusted Score: 95.657% Critics Consensus: Flawlessly cast and brimming with dark, acid wit, American Beauty is a smart, provocative high point of late '90s mainstream Hollywood film. Synopsis: A biting, penetrating and often humorous take on contemporary life in suburban America, Lester Burnham becomes intrigued by a young... Starring: , , , Directed By: #234 (2010) 87% #234 Adjusted Score: 92.942% Critics Consensus: This emotionally gripping examination of a marriage on the rocks isn't always easy to watch, but Michelle Williams and Ryan Gosling give performances of unusual depth and power. Synopsis: A complex portrait of a contemporary American marriage, \"Blue Valentine\" tells the story of David and Cindy, a couple who... Starring: , , , Directed By: , #233 (2017) 87% #233 Adjusted Score: 97.338% Critics Consensus: It Comes at Night makes lethally effective use of its bare-bones trappings while proving once again that what's left unseen can be just as horrifying as anything on the screen. Synopsis: Imagine the end of the world. Now imagine something worse. Award-winning filmmaker Trey Edward Shults follows his incredible debut feature... Starring: , , , Directed By: #232 (2012) 87% #232 Adjusted Score: 97.541% Critics Consensus: Bold, bloody, and stylistically daring, Django Unchained is another incendiary masterpiece from Quentin Tarantino. Synopsis: Set in the South two years before the Civil War, Django Unchained stars Jamie Foxx as Django, a slave whose... Starring: , , , Directed By: #231 (2010) 87% #231 Adjusted Score: 97.92% Critics Consensus: Smart, innovative, and thrilling, Inception is that rare summer blockbuster that succeeds viscerally as well as intellectually. Synopsis: Visionary filmmaker Christopher Nolan (Memento, The Dark Knight) writes and directs this psychological sci-fi action film about a thief who... Starring: , , , Directed By: #230 (2015) 88% #230 Adjusted Score: 88.051% Critics Consensus: No consensus yet. Synopsis: Chronicling events that unfolded over 93 days in 2013 and 2014, this documentary witnesses the formation of a new civil... Starring: Directed By: #229 (2017) 88% #229 Adjusted Score: 88.193% Critics Consensus: Burning Sands covers familiar territory, but Trevor Jackson's layered performance and director/co-writer Gerard McMurray's empathetic approach help set it apart. Synopsis: Burning Sands takes you on a raw, voyeuristic journey of fraternity pledging through the eyes of one favored pledgee, who... Starring: , , , Directed By: #228 (2017) 88% #228 Adjusted Score: 88.469% Critics Consensus: As informative as it is entertaining, Get Me Roger Stone offers a close-up look at the right-wing gadfly who helped shape the 2016 presidential election. Synopsis: After the 2016 election, people all over the world woke up to find that Donald J. Trump, New York real... Starring: , , , Directed By: , , #227 (2016) 88% #227 Adjusted Score: 88.453% Critics Consensus: No consensus yet. Synopsis: As their parents head out for a date in the city, the three young Thompson children immediately take to their... Starring: , , , Directed By: #226 (2018) 88% #226 Adjusted Score: 88.982% Critics Consensus: No consensus yet. Synopsis: La Ciotat, the South of France. Antoine attends a summer writing workshop in which a few young people have been... Starring: , , , Directed By: #225 (1990) 88% #225 Adjusted Score: 90.617% Critics Consensus: An affectionate throwback to 1950s creature features, Tremors reinvigorates its genre tropes with a finely balanced combination of horror and humor. Synopsis: Tremors is actually two movies in one. On its own terms, it's an enjoyable modern sci-fi horror-thriller, with good pacing... Starring: , , , Directed By: #224 (2019) 88% #224 Adjusted Score: 89.412% Critics Consensus: The Great Hack offers an alarming glimpse of the way data is being weaponized for political gain -- and what it might mean for future elections. Synopsis: Data, arguably the world's most valuable asset, is being weaponized to wage cultural and political wars. The dark world of... Starring: Directed By: , #223 (2016) 88% #223 Adjusted Score: 89.18% Critics Consensus: Phantom Boy's stunning animation and old-fashioned charm more than make up for a relative lack of narrative depth. Synopsis: Leo has a secret. A mysterious illness has transformed him into a phantom boy, able to leave the confines of... Starring: , , , Directed By: , #222 (2020) 90% #222 Adjusted Score: 92.134% Critics Consensus: An appealing animated adventure whose silliness is anchored in genuine emotion, The Willoughbys offers fanciful fun the entire family can enjoy. Synopsis: Convinced they'd be better off raising themselves, the Willoughby children hatch a sneaky plan to send their selfish parents on... Starring: , , , Directed By: #221 (2017) 88% #221 Adjusted Score: 89.662% Critics Consensus: The Incredible Jessica James makes its standard storyline feel new, almost purely on the strength of a captivating, potentially star-making performance from Jessica Williams. Synopsis: An aspiring NYC playwright (Jessica Williams) gets over a painful breakup by bonding with a man who was also recently... Starring: , , , Directed By: #220 (1989) 88% #220 Adjusted Score: 93.28% Critics Consensus: Lighter and more comedic than its predecessor, Indiana Jones and the Last Crusade returns the series to the brisk serial adventure of Raiders, while adding a dynamite double act between Harrison Ford and Sean Connery. Synopsis: The third installment in the Spielberg/Lucas Indiana Jones saga, Indiana Jones and the Last Crusade evokes many of the thrills... Starring: , , , Directed By: #219 (2018) 88% #219 Adjusted Score: 90.493% Critics Consensus: Cargo takes a refreshingly character-driven approach to the zombie genre that's further distinguished by its Australian setting and Martin Freeman's terrific lead performance. Synopsis: Stranded in rural Australia in the aftermath of a violent pandemic, an infected father desperately seeks a new home for... Starring: , , , Directed By: , #218 (2016) 88% #218 Adjusted Score: 90.59% Critics Consensus: Morris from America adds some novel narrative twists to its father-son story -- and gains added resonance thanks to a powerful performance from Craig Robinson. Synopsis: This coming-of-age drama follows 13-year-old Morris as he moves to Heidelberg, Germany with his father and adjusts to his vastly... Starring: , , , Directed By: #217 (2016) 88% #217 Adjusted Score: 91.402% Critics Consensus: The Invitation makes brilliant use of its tension-rich premise to deliver a uniquely effective -- and surprisingly clever -- slow-building thriller. Synopsis: In this taut psychological thriller by Karyn Kusama (Girlfight, Jennifer's Body), the tension is palpable when Will (Logan Marshall-Green, Prometheus)... Starring: , , , Directed By: #216 (2016) 88% #216 Adjusted Score: 92.299% Critics Consensus: Rising on the strength of Rebecca Hall's gripping performance, Christine offers an empathetic look at its subject's public career and painful private life. Synopsis: Rebecca Hall stars in director Antonio Campos' third feature film, CHRISTINE, the story of a woman who finds herself caught... Starring: , , , Directed By: #215 (2003) 88% #215 Adjusted Score: 93.901% Critics Consensus: Anchored by the exceptional acting of its strong cast, Mystic River is a somber drama that unfolds in layers and conveys the tragedy of its story with visceral power. Synopsis: Directed by Clint Eastwood, the mysterious drama Mystic River is based on the novel by Dennis Lehane and adapted by... Starring: , , , Directed By: #214 (2016) 87% #214 Adjusted Score: 96.94% Critics Consensus: As strange as it is thrillingly ambitious, The Lobster is definitely an acquired taste -- but for viewers with the fortitude to crack through Yorgos Lanthimos' offbeat sensibilities, it should prove a savory cinematic treat. Synopsis: Colin Farrell stars as David, a man who has just been dumped by his wife. To make matters worse, David... Starring: , , , Directed By: #213 (2018) 88% #213 Adjusted Score: 99.555% Critics Consensus: Ralph Breaks the Internet levels up on its predecessor with a funny, heartwarming sequel that expands its colorful universe while focusing on core characters and relationships. Synopsis: In \"Ralph Breaks the Internet,\" video-game bad guy Ralph (voice of John C. Reilly) and best friend Vanellope von Schweetz... Starring: , , , Directed By: , #212 (2018) 88% #212 Adjusted Score: 106.682% Critics Consensus: A lighter, brighter superhero movie powered by the effortless charisma of Paul Rudd and Evangeline Lilly, Ant-Man and The Wasp offers a much-needed MCU palate cleanser. Synopsis: From the Marvel Cinematic Universe comes a new chapter featuring heroes with the astonishing ability to shrink: \"Ant-Man and The... Starring: , , , Directed By: #211 (2015) 89% #211 Adjusted Score: 89.135% Critics Consensus: A smart, odball take on found-footage horror, Creep is clever and well-acted enough to keep viewers on the edges of their seats. Synopsis: Looking for work, Aaron (Patrick Brice) comes across a cryptic online ad: \"$1,000 for the day. Filming service. Discretion is... Starring: , Directed By: #210 (2018) 89% #210 Adjusted Score: 89.322% Critics Consensus: Unassuming yet surprisingly impactful, The Desert Bride offers an absorbing, well-acted reflection on life's surprises and the unlikely connections we make along the way. Synopsis: 54-year-old Teresa has worked for decades as a live-in maid with a family in Buenos Aires. When the family sells... Starring: , Directed By: , #209 (2017) 89% #209 Adjusted Score: 89.607% Critics Consensus: Joan Didion: The Center Will Not Hold pays tribute to an American literary legend with a richly personal perspective that should thrill devotees while enlightening newcomers. Synopsis: Across more than 50 years of essays, novels, screenplays, and criticism, Joan Didion has been our premier chronicler of the... Starring: , , , Directed By: #208 (2019) 89% #208 Adjusted Score: 89.737% Critics Consensus: Master Z: Ip Man Legacy marks a departure from previous entries in the franchise -- but its thrilling action set pieces remain every bit as satisfying. Synopsis: Legendary action director Yuen Woo-Ping draws on a stellar cast (Michelle Yeoh, Dave Bautista, Tony Jaa, and Max Zhang) to... Starring: , , , Directed By: #207 (2015) 89% #207 Adjusted Score: 89.892% Critics Consensus: What Happened, Miss Simone? is a compelling -- albeit necessarily incomplete -- overview of its complex subject's singular artistic legacy and fascinating life. Synopsis: Using never-before-heard recordings, rare archival footage and her best-known songs, this is the story of legendary singer and activist Nina... Starring: Directed By: #206 (2018) 89% #206 Adjusted Score: 90.124% Critics Consensus: The Breaker Upperers brings the laughs early and often, thanks to the dry wit -- and effervescent chemistry -- of writer-director-star duo Jackie van Beek and Madeleine Sami. Synopsis: Fifteen years ago, Mel (Madeleine Sami) and Jen (Jackie van Beek) discovered they were being two-timed by the same man.... Starring: , , , Directed By: , #205 (2017) 89% #205 Adjusted Score: 90.112% Critics Consensus: Rich in atmosphere and period detail, Super Dark Times is an effective teen thriller whose true power lies in its approach to deeper themes. Synopsis: A harrowing but meticulously observed look at teenage lives in the era prior to the Columbine High School massacre, SUPER... Starring: , , , Directed By: #204 (2017) 89% #204 Adjusted Score: 90.892% Critics Consensus: I don't feel at home in this world anymore. transcends its unwieldy title to offer timely, intoxicatingly dark observations on gender dynamics and social norms in modern America. Synopsis: Fed up with the human indecency she sees around her and set off by her home being burglarized, Ruth (Melanie... Starring: , , , Directed By: #203 (2018) 89% #203 Adjusted Score: 91.587% Critics Consensus: Tender performances and a strong sense of style combine to create an eccentric, dreamy portrait of love and loneliness in On Body and Soul. Synopsis: Two introverted people find out by pure chance that they share the same dream every night. They are puzzled, incredulous,... Starring: , , , Directed By: #202 (2018) 89% #202 Adjusted Score: 92.154% Critics Consensus: Mary and the Witch's Flower honors its creator's Studio Ghibli roots with a gentle, beautifully animated story whose simplicity is rounded out by its entrancing visuals. Synopsis: From Academy Award (R)-nominee Hiromasa Yonebayashi - animator on Studio Ghibli masterpieces Spirited Away, Howl's Moving Castle, and Ponyo, and... Starring: , , , Directed By: #201 (2019) 89% #201 Adjusted Score: 92.391% Critics Consensus: Carried by the infectious charms of Ali Wong and Randall Park, Always Be My Maybe takes familiar rom-com beats and cleverly layers in smart social commentary to find its own sweet groove. Synopsis: Childhood sweethearts have a falling out and don't speak for 15 years. They reconnect as adults when Sasha, now a... Starring: , , , Directed By: #200 (2016) 89% #200 Adjusted Score: 92.145% Critics Consensus: Blood Father meets every expectation a film fan could have for a latter-day Mel Gibson action thriller with its title -- and even, in some respects, handily exceeds them. Synopsis: BLOOD FATHER stars Mel Gibson as Link, an ex-convict who fights to protect his estranged daughter from the drug cartel... Starring: , , , Directed By: #199 (1999) 89% #199 Adjusted Score: 93.393% Critics Consensus: Disney's Tarzan takes the well-known story to a new level with spirited animation, a brisk pace, and some thrilling action set-pieces.. Synopsis: A man raised by gorillas must decide where he really belongs when he discovers he is a human.... Starring: , , , Directed By: , #198 (2008) 89% #198 Adjusted Score: 95.815% Critics Consensus: Bolt is a pleasant animated comedy that overcomes the story's familiarity with strong visuals and likable characters. Synopsis: For super-dog \"Bolt\", every day is filled with adventure, danger and intrigue - at least until the cameras stop rolling.... Starring: , , , Directed By: , #197 (2013) 89% #197 Adjusted Score: 96.176% Critics Consensus: Raw, honest, powerfully acted, and deliciously intense, Blue Is the Warmest Color offers some of modern cinema's most elegantly composed, emotionally absorbing drama. Synopsis: BLUE IS THE WARMEST COLOR centers on a 15-year-old girl named Adèle (Exarchopoulos) who is climbing to adulthood and dreams... Starring: , , , Directed By: #196 (2019) 89% #196 Adjusted Score: 98.084% Critics Consensus: Led by outstanding performances from its well-matched leads, The Two Popes draws absorbing drama from a pivotal moment in modern organized religion. Synopsis: Frustrated with the direction of the church, Cardinal Bergoglio (Jonathan Pryce) requests permission to retire in 2012 from Pope Benedict... Starring: , , , Directed By: #195 (2017) 88% #195 Adjusted Score: 97.099% Critics Consensus: 20th Century Women offers Annette Bening a too-rare opportunity to shine in a leading role -- and marks another assured step forward for writer-director Mike Mills. Synopsis: During the summer of 1979, a Santa Barbara single mom and boardinghouse landlord (Annette Bening) decides the best way she... Starring: , , , Directed By: #194 (2015) 89% #194 Adjusted Score: 97.335% Critics Consensus: Gritty, gripping, and weighted with thought-provoking heft, A Most Violent Year represents another strong entry in writer-director J.C. Chandor's impressive filmography. Synopsis: Set during the winter of 1981 -- statistically one of the most crime-ridden of New York City's history -- A... Starring: , , , Directed By: #193 (2009) 89% #193 Adjusted Score: 99.797% Critics Consensus: A classic Tarantino genre-blending thrill ride, Inglourious Basterds is violent, unrestrained, and thoroughly entertaining. Synopsis: \"Inglourious Basterds\" begins in German-occupied France, where Shosanna Dreyfus witnesses the execution of her family at the hand of Nazi... Starring: , , , Directed By: #192 (2017) 90% #192 Adjusted Score: 82.626% Critics Consensus: No consensus yet. Synopsis: The long-awaited sequel to Baahubali: The Beginning, one of the top-grossing Indian epic historical fantasy films of all-time, the conclusion... Starring: , , , Directed By: #191 (2013) 90% #191 Adjusted Score: 90.235% Critics Consensus: No consensus yet. Synopsis: A shocking exposé of how pharmaceutical companies use patent law to keep profits unconscionably high even at the expense of... Starring: , , , Directed By: , #190 (2018) 90% #190 Adjusted Score: 90.416% Critics Consensus: A bloody thrill ride designed to test the limits of more squeamish viewers, The Night Comes for Us wields a stylishly violent, action-packed punch. Synopsis: The Night Comes For Us follows Ito (played by Joe Taslim), a former triad enforcer, and his mission to protect... Starring: , , , Directed By: #189 (2017) 90% #189 Adjusted Score: 90.377% Critics Consensus: A scarily effective horror outing, Veronica proves it doesn't take fancy or exotic ingredients to craft skin-crawling genre thrills. Synopsis: Veronica has taken care of her little brother and sister since the death of their father. One day during a... Starring: , , Directed By: #188 (2016) 90% #188 Adjusted Score: 90.325% Critics Consensus: No consensus yet. Synopsis: Former high school sweethearts Jim (Mark Duplass) and Amanda (Sarah Paulson) have been out of touch for more than 20... Starring: , , Directed By: #187 (2017) 90% #187 Adjusted Score: 90.882% Critics Consensus: Our Souls at Night honors the quiet strength of its source material by offering a simple yet sturdy canvas for two talented veteran leads to bring its story to life. Synopsis: Based on the best-selling novel written by Kent Haruf and adapted for the screen by Scott Neustadter and Michael H.... Starring: , , , Directed By: #186 (2019) 90% #186 Adjusted Score: 90.978% Critics Consensus: It takes its time coming together, but the quietly effective Paddleton pulls off a tricky tonal balancing act, thanks largely to the strengths of its well-chosen leads. Synopsis: An unlikely friendship between two misfit neighbors becomes an unexpectedly emotional journey when the younger man is diagnosed with terminal... Starring: , Directed By: #185 (1987) 90% #185 Adjusted Score: 92.988% Critics Consensus: Elevated by a perceptive performance by a perfectly cast Lou Diamond Phillips, La Bamba distills its subject's creative energy -- and reflects his music's enduring appeal. Synopsis: La Bamba is the story of 1950s rock 'n' roll rage Ritchie Valens (born Ricardo Valenzuela), played herein with gusto... Starring: , , , Directed By: #184 (2017) 90% #184 Adjusted Score: 91.249% Critics Consensus: Beautifully filmed and powerfully acted, Walking Out effectively balances tense father-son drama against an affecting wilderness survival story. Synopsis: A teenager, David, journeys to Montana to hunt big game with his estranged father, Cal. Father and son struggle to... Starring: , , , Directed By: , #183 (1993) 90% #183 Adjusted Score: 93.52% Critics Consensus: It's sentimental and somewhat predictable, but those are small complaints, given the tender atmosphere and moving performances at the heart of What's Eating Gilbert Grape. Synopsis: Gilbert has to care for his brother Arnie and his obese mother, which gets in the way when love walks... Starring: , , , Directed By: #182 (1982) 90% #182 Adjusted Score: 94.397% Critics Consensus: Tootsie doesn't squander its high-concept comedy premise with fine dialogue and sympathetic treatment of the characters. Synopsis: Michael Dorsey is a talented actor, but his demanding nature and stubborn temperament have antagonized every producer in New York.... Starring: , , , Directed By: #181 (2019) 90% #181 Adjusted Score: 92.474% Critics Consensus: Suspenseful, well-acted, and intelligent, I Am Mother is an ambitious sci-fi story that largely achieves its impressive aims. Synopsis: I AM MOTHER is a sci-fi thriller about a teenage girl (Clara Rugaard), who is the first of a new... Starring: , , , Directed By: #180 (2018) 90% #180 Adjusted Score: 92.965% Critics Consensus: Happy as Lazzaro uses a friendship's ups and downs as a satisfyingly expansive canvas for a picture rich with thematic and cinematic depth. Synopsis: Lazzaro is a naive and optimistic twenty-year-old farmer; Tancredi is instead a young man with a fervid imagination. Between the... Starring: , , , Directed By: #179 (2014) 90% #179 Adjusted Score: 96.116% Critics Consensus: Tackling a sensitive subject with maturity, honesty, and wit, Obvious Child serves as a deeply promising debut for writer-director Gillian Robespierre. Synopsis: For aspiring comedian Donna Stern, everyday life as a female twenty-something provides ample material for her incredibly relatable brand of... Starring: , , , Directed By: #178 (2015) 90% #178 Adjusted Score: 96.106% Critics Consensus: Bolstered by a trio of powerful performances from its talented leads, Clouds of Sils Maria is an absorbing, richly detailed drama with impressive depth and intelligence. Synopsis: Maria Enders (Juliette Binoche) is an actress at the peak of her international career who is asked to perform in... Starring: , , , Directed By: #177 (2009) 90% #177 Adjusted Score: 95.984% Critics Consensus: Boosted by Sam Rockwell's intense performance, Moon is a compelling work of science-fiction, and a promising debut from director Duncan Jones. Synopsis: An astronaut miner extracting the precious moon gas that promises to reverse the Earth's energy crisis nears the end of... Starring: , , , Directed By: #176 (2009) 90% #176 Adjusted Score: 97.034% Critics Consensus: Blending dark humor with profoundly personal themes, the Coen brothers deliver what might be their most mature -- if not their best -- film to date. Synopsis: \"A Serious Man\" is the story of an ordinary man's search for clarity in a universe where Jefferson Airplane is... Starring: , , , Directed By: , , #175 (2002) 90% #175 Adjusted Score: 97.338% Critics Consensus: Thought-provoking and visceral, Steven Spielberg successfully combines high concept ideas and high octane action in this fast and febrile sci-fi thriller. Synopsis: Based on a short story by the late Philip K. Dick, this science fiction-thriller reflects the writer's familiar preoccupation with... Starring: , , , Directed By: #174 (2009) 90% #174 Adjusted Score: 100.254% Critics Consensus: Technically brilliant and emotionally wrenching, District 9 has action, imagination, and all the elements of a thoroughly entertaining science-fiction classic. Synopsis: Director Neill Blomkamp teams with producer Peter Jackson for this tale of extraterrestrial refugees stuck in contemporary South Africa. It's... Starring: , , , Directed By: #173 (2016) 90% #173 Adjusted Score: 102.718% Critics Consensus: As thought-provoking as it is visually compelling, The Witch delivers a deeply unsettling exercise in slow-building horror that suggests great things for debuting writer-director Robert Eggers. Synopsis: In this exquisitely made and terrifying new horror film, the age-old concepts of witchcraft, black magic and possession are innovatively... Starring: , , , Directed By: #172 (2015) 91% #172 Adjusted Score: 88.01% Critics Consensus: No consensus yet. Synopsis: The suburra, a rough neighborhood of Rome, is the scene of an ambitious real estate project. But, with the state,... Starring: , , , Directed By: #171 (2016) 91% #171 Adjusted Score: 91.368% Critics Consensus: No consensus yet. Synopsis: Walt, a down-on-his luck carpenter, is tasked with entertaining his eight-year-old son Anthony while Anthony's mom and her new husband... Starring: , , , Directed By: #170 (1986) 91% #170 Adjusted Score: 93.481% Critics Consensus: With She's Gotta Have It, Spike Lee delivered his bracing first shot across Hollywood's bow -- and set the template for the groundbreaking act to follow. Synopsis: Spike Lee's breakthrough independent feature, shot in fifteen days on a budget of $175,000, ushered in (along with Jim Jarmusch's... Starring: , , , Directed By: #169 (2017) 91% #169 Adjusted Score: 91.561% Critics Consensus: Nobody Speaks: The Trials of the Free Press persuasively -- and entertainingly -- outlines the troubling tensions threatening journalism in the internet era. Synopsis: When the online tabloid Gawker posted a surreptitiously filmed sex tape of professional wrestler Hulk Hogan, it ignited a high... Starring: , , , Directed By: #168 (1992) 91% #168 Adjusted Score: 93.044% Critics Consensus: Like Water for Chocolate plays to the senses with a richly rewarding romance that indulges in magical realism to intoxicating effect. Synopsis: Based on the best-selling novel by Laura Esquival, this internationally popular romantic fable from Mexico centers on a young woman... Starring: , , , Directed By: #167 (2017) 91% #167 Adjusted Score: 91.974% Critics Consensus: Thanks to director Zak Hilditch's patient storytelling and strong work from lead Thomas Jane, 1922 ranks among the more satisfying Stephen King adaptations. Synopsis: 1922 is based on Stephen King's 131-page story telling of a man's confession of his wife's murder. The tale is... Starring: , , , Directed By: #166 (1971) 91% #166 Adjusted Score: 95.9% Critics Consensus: Willy Wonka and the Chocolate Factory is strange yet comforting, full of narrative detours that don't always work but express the film's uniqueness. Synopsis: Promoted as a family musical by Paramount Pictures, Willy Wonka and the Chocolate Factory is more of a black comedy,... Starring: , , , Directed By: #165 (2017) 91% #165 Adjusted Score: 93.489% Critics Consensus: Carla Gugino carries Gerald's Game's small-scale suspense with a career-defining performance. Synopsis: Gerald Burlingame (Bruce Greenwood) and his wife Jessie (Carla Gugino) attempt to rekindle the flames of their marriage with a... Starring: , , , Directed By: #164 (1996) 91% #164 Adjusted Score: 95.752% Critics Consensus: A brutal, often times funny, other times terrifying portrayal of drug addiction in Edinburgh. Not for the faint of heart, but well worth viewing as a realistic and entertaining reminder of the horrors of drug use. Synopsis: Mark Renton (Ewan McGregor), a young man with few prospects and fewer ambitions, lives in economically depressed Edinburgh. Like most... Starring: , , , Directed By: #163 (2018) 91% #163 Adjusted Score: 94.437% Critics Consensus: Elevated by a bravura performance from Maggie Gyllenhaal, The Kindergarten Teacher is one American remake that retains its impact the second time around. Synopsis: Writer-director Sarah Colangelo's sophomore feature film is based on the 2014 Israeli film of the same name. Maggie Gyllenhaal plays... Starring: , , , Directed By: #162 (2015) 91% #162 Adjusted Score: 94.962% Critics Consensus: Well-acted and steeped in Southern atmosphere, Mississippi Grind is a road movie and addiction drama that transcends each of its well-worn genres. Synopsis: Gerry is a talented poker player, but his gambling habit is getting the best of him. One day, he meets... Starring: , , , Directed By: , #161 (2019) 91% #161 Adjusted Score: 95.838% Critics Consensus: Entertaining if not essential, El Camino adds a satisfying belated coda to the Breaking Bad story -- led by a career-best performance from Aaron Paul. Synopsis: The Netflix Television Event EL CAMINO: A BREAKING BAD MOVIE reunites fans with Jesse Pinkman (Emmy-winner Aaron Paul). In the... Starring: , , , Directed By: #160 (2013) 91% #160 Adjusted Score: 95.792% Critics Consensus: While it's plenty predictable and sentimental, The Sapphires also has an irresistible feel-good vibe, winning music and charming performances to spare. Synopsis: Inspired by a true story, THE SAPPHIRES follows four vivacious, young and talented Australian Aboriginal girls from a remote mission... Starring: , , , Directed By: #159 (2013) 91% #159 Adjusted Score: 97.069% Critics Consensus: The Spectacular Now is an adroit, sensitive film that avoids typical coming-of-age story trappings. Synopsis: With sly humor and an intensity of feeling, THE SPECTACULAR NOW (directed by James Ponsoldt) creates a vivid, three-dimensional portrait... Starring: , , , Directed By: #158 (2014) 91% #158 Adjusted Score: 99.198% Critics Consensus: A one-man show set in a single confined location, Locke demands a powerful performance -- and gets it from a never-more-compelling Tom Hardy. Synopsis: Ivan Locke (Hardy) has worked diligently to craft the life he has envisioned, dedicating himself to the job that he... Starring: , , , Directed By: #157 (2018) 91% #157 Adjusted Score: 100.289% Critics Consensus: The Ballad of Buster Scruggs avoids anthology pitfalls with a consistent collection tied together by the Coen brothers' signature blend of dark drama and black humor. Synopsis: The Ballad of Buster Scruggs is a six-part Western anthology film, a series of tales about the American frontier told... Starring: , , , Directed By: , #156 (2007) 91% #156 Adjusted Score: 98.852% Critics Consensus: Widely touted as a masterpiece, this sparse and sprawling epic about the underhanded \"heroes\" of capitalism boasts incredible performances by leads Daniel Day-Lewis and Paul Dano, and is director Paul Thomas Anderson's best work to date. Synopsis: Writer-director Paul Thomas Anderson steps outside his contemporary world of dysfunctional Angelenos to explore a very different dysfunctional man --... Starring: , , , Directed By: #155 (2016) 91% #155 Adjusted Score: 100.043% Critics Consensus: Green Room delivers unapologetic genre thrills with uncommon intelligence and powerfully acted élan. Synopsis: GREEN ROOM is a brilliantly crafted and wickedly fun horror-thriller starring Patrick Stewart as a diabolical club owner who squares... Starring: , , , Directed By: #154 (2017) 92% #154 Adjusted Score: 101.833% Critics Consensus: A visual treat filled out by consistently stellar work from Robert Pattinson, Good Time is a singularly distinctive crime drama offering far more than the usual genre thrills. Synopsis: After a botched bank robbery lands his younger brother in prison, Constantine Nikas (Robert Pattinson) embarks on a twisted odyssey... Starring: , , , Directed By: , #153 (2010) 91% #153 Adjusted Score: 98.364% Critics Consensus: Led by a trio of captivating performances from Mark Wahlberg, Christian Bale, and Amy Adams, The Fighter is a solidly entertaining, albeit predictable, entry in the boxing drama genre. Synopsis: Mark Wahlberg stars in Paramount Pictures' inspirational docudrama exploring the remarkable rise of Massachusetts-born, junior welterweight title winner \"Irish\" Micky... Starring: , , , Directed By: #152 (2017) 91% #152 Adjusted Score: 102.394% Critics Consensus: A Ghost Story deftly manages its ambitious themes through an inventive, artful, and ultimately poignant exploration of love and loss. Synopsis: With A GHOST STORY, acclaimed director David Lowery (AIN'T THEM BODIES SAINTS, PETE'S DRAGON) returns with a singular exploration of... Starring: , , , Directed By: #151 (2009) 91% #151 Adjusted Score: 100.205% Critics Consensus: Led by charismatic performances by its three leads, director Jason Reitman delivers a smart blend of humor and emotion with just enough edge for mainstream audiences. Synopsis: Ryan Bingham, a corporate hatchet man who loves his life on the road, is forced to fight for his job... Starring: , , , Directed By: Pages: 1 Movie & TV News Featured on RT Top Headlines – – – – – – Tag Cloud Follow Us Copyright © 2018 Fandango. All rights reserved. | | Copyright © 2018 Fandango. All rights reserved."
  },
  {
    "url": "https://editorial.rottentomatoes.com/guide/hidden-gem-series-on-amazon-prime-video/",
    "title": "  75 Hidden Gem Series on Amazon Prime Video << Rotten Tomatoes – Movie and TV News",
    "description": "Follow Us Trending on RT (Photo by © Amazon Prime Video ) 75 Hidden Gem Series on Amazon Prime Video Amazon Prime Video is one of the most overwhelming streaming services out there: it’s overflowing with viewing options for Prime members, from originals to recent hit network and cable series to old-school classics. And then there’s the stuff you can pay for – which is basically everything. To help you cut through the clutter, the Rotten Tomatoes staff trawled through Amazon Prime Video’s options to uncover 75 series we think are hidden gems worthy of your streaming queue. These are not the streamer’s highest-profile hits – if you need to be reminded that The Marvelous Mrs. Maisel exists, check out our guide to the very – but great and interesting shows that have flown under the radar, or which you might not know were available with your Prime subscription. (And we stuck to the shows available with Prime, leaving out shows you need to purchase or rent.) In this guide, you’ll find Prime originals the critics loved but which haven’t gotten the attention we think they deserve (, , ); acclaimed “peak TV”-era shows you may be surprised to find available with Prime (, ); classics you may be even more surprised to see here (, , 3); and some foreign gems (British comedy , French thriller ). We’ve divided the list up by genre to help you find the right show for your mood. And while many of the selections have multiple seasons, we linked to the page for each show’s first season because, well, that’s generally the best place to start and get a sense of whether the show is right for you. For more info on each show, and to read reviews, click into the show title. For now, happy bingeing, and we hope you find something surprising and special in the list below. Found a hidden gem on Amazon Prime Video that’s not on our list? Let your fellow fans know in the comments. Comedies (2007) 85% #80 Adjusted Score: 86.738% Critics Consensus: A smart mix of workplace comedy and spy thriller conventions, Chuck is funny, sharply paced, and deftly written. Synopsis: This high-concept action comedy follows a regular 26-year-old everyman whose life is thrown into disarray after his friend, a CIA... Starring: , , , (2009) 65% #77 Adjusted Score: 65.821% Critics Consensus: Eastbound & Down might be too profane and obnoxious for some, but its broad humor and irreverent vibe make for some great comic moments. Synopsis: Washed-up major-league pitcher Kenny Powers (Danny McBride) returns to his North Carolina hometown after his career fizzles out in the... Starring: , , , Directed By: , (2011) 95% #76 Adjusted Score: 95.679% Critics Consensus: Smartly written, well acted, and emotionally resonant, Awkward captures the anxiety of teenage life with wit and insight. Synopsis: This comedy series is about an ordinary teen, Jenna Hamilton (Ashley Rickards), who is thrust into the spotlight at school... Starring: , , , Directed By: , , (2016) 90% #75 Adjusted Score: 93.382% Critics Consensus: Likeable characters add realism and heart to the tongue-in-cheek humor and high-octane action that fuels The Tick. Synopsis: Evildoers everywhere beware! Peter Serafinowicz plays the nigh invulnerable hero in this Amazon Original series, featuring favorites from the comic... Starring: , , , (2002) 100% #74 Adjusted Score: 100.716% Critics Consensus: Monk is a pedestrian procedural anchored by an extraordinary star performance, with Tony Shalhoub bringing both beguiling eccentricity and rich humanity to the titular detective. Synopsis: The first season of this quirky detective show introduces Adrian Monk (Tony Shaloub), a private eye with obsessive-compulsive disorder who,... Starring: , , , Directed By: , , , (2016) 69% #73 Adjusted Score: 70.226% Critics Consensus: Jean-Claude Van Damme parodies his own martial arts image with world-weary grace, but this series' scattershot laugh ratio and limited production value could leave viewer reaction as split as the star's thighs. Synopsis: A world-renowned martial arts expert and undercover agent for hire comes out of retirement after chance encounter with a long... Starring: , , , (2003) 100% #72 Adjusted Score: 100.017% Synopsis: The first season of the British sitcom \"Peep Show\" introduces Jeremy (Robert Webb) and Mark (David Mitchell), two 20-somethings whose... Starring: , , , (2001) 96% #71 Adjusted Score: 97.881% Critics Consensus: With a first season that altered the TV comedy landscape, the original British version of The Office proves the most mundane parts of daily life can be as hilarious as they are cringeworthy. Synopsis: Wickedly funny mockumentary tracking the monotonous doings at a paper-product firm in the dreary London suburb of Slough.... Starring: , , , Directed By: (1989) #70 Adjusted Score: -0.156% Synopsis: A series featuring the performance of parodies and skits.... Starring: (2014) 79% #69 Adjusted Score: 80.515% Critics Consensus: Red Oaks offers an affectionate nod to 1980s sex comedies that -- largely thanks to a talented ensemble cast -- finds fresh humor in its familiar premise. Synopsis: An assistant tennis pro tries to figure out his future while working at a country club in suburban New Jersey.... Starring: , , , (2006) 55% #68 Adjusted Score: 56.519% Critics Consensus: Its premise is sure to draw comparisons to Monk, and Psych's lead character is an acquired taste at best. Synopsis: Creator Steve Franks' comedic entry into the crime-solving genre follows the investigative efforts of fake psychic Shawn Spencer (James Roday)... Starring: , , , Directed By: , , , (1996) 42% #67 Adjusted Score: 43.103% Critics Consensus: A likable cast and charming concept couldn't save 3rd Rock from the Sun from the critics, but it would later prove to be more than a Mork and Mindy knockoff. Synopsis: Sitcom about aliens who look like earthlings (but can't quite get the hang of acting like them), and who observe... Starring: , , , Directed By: (2003) 75% #66 Adjusted Score: 76.034% Critics Consensus: Dead Like Me is a required (after)taste, but the series' acidic wit and wry observations about the simple pleasures of life and death overcome the deficit in likable characters. Synopsis: A dark comedy about a glum 18-year-old college dropout who becomes a Grim Reaper after she's hit by falling debris... Starring: , , , Directed By: , , , (1964) 100% #64 Adjusted Score: 100.245% Synopsis: Comedy about a ghoulish household, created by the cartoonist Charles Addams.... Starring: , , , Directed By: , , , Dramas (2018) 90% #51 Adjusted Score: 94.392% Critics Consensus: Patrick Melrose is a scathing indictment of British high society's inherited dysfunction, cruelty, and the wealth that enables them. The Crown this ain't. Synopsis: Patrick Melrose (Benedict Cumberbatch) is the heir of a decadent and troubled aristocratic family, who had a traumatic childhood living... Starring: , , , (2002) 85% #62 Adjusted Score: 88.167% Critics Consensus: Though it takes its time getting started, The Wire is worth the wait, spinning a connective web of characters and delivering no-holds-barred commentary on some of America's unsettling societal problems. Synopsis: A complex crime drama set in Baltimore, Maryland, that follows the thread of a single police investigation, from the perspectives... Starring: , , , Directed By: , , , (2012) #60 Synopsis: This epic miniseries spans the first life in Mesopotamia through the discovery of America, capturing the danger, action, and adrenaline... Starring: (2018) 94% #59 Adjusted Score: 95.897% Critics Consensus: Forever is a gently harrowing and mirthful dive into the ennui of matrimony, elevated by Maya Rudolph's dazzling turn of not-so-quiet desperation. Synopsis: Married couple June (Maya Rudolph) and Oscar (Fred Armisen) live a comfortable but predictable life in suburban Riverside, California. For... Starring: (2018) 74% #58 Adjusted Score: 75.817% Critics Consensus: Brilliantly bonkers, Britannia's duplicitous characters and campy fantasy won't be for everyone, but those looking for less-serious swords and sorcery may enjoy its spellbinding madness. Synopsis: Filmed overseas in Prague and Wales, Britannia is set in 43AD as the Roman Imperial Army, determined and terrified in... Starring: , , , (2017) 64% #57 Adjusted Score: 64.568% Critics Consensus: The Last Post is old fashioned to a fault and features too many anachronisms to claim historical authenticity, but the series does provide a pleasing dose of escapism. Synopsis: In The Last Post, the men in the police unit don't have easy jobs: half soldiers, half policemen and full... Starring: , , , (2015) 82% #56 Adjusted Score: 82.771% Critics Consensus: Patriot is dark, quirky, and often funny -- and although its risks don't always pay off, the series is still savvy and inspired enough to watch. Synopsis: Series 1 sees an intelligence officer take an undercover assignment in Iran, but PTSD spells, incompetency in the federal government... Starring: , , , (2019) 69% #55 Adjusted Score: 71.11% Critics Consensus: Grim and graphic, Too Old to Die Young is stylish, but its languid story does little to justify its violent tendencies-- though fans of Refn's may find enjoyment in its neon laden misery. Synopsis: In one tragic night, Los Angeles County Sheriff's Deputy Martin Jones's life is blown apart, and he is forced into... Starring: , , , (2016) 94% #54 Adjusted Score: 94.113% Critics Consensus: The Durrells in Corfu is crisp and confident, offering viewers an escape into dreamy scenery and a witty performance by star Keeley Hawes. Synopsis: Adapted from Gerald Durrell's My Family and Other Animals and its two sequels, Season 1 of the family drama about... Starring: , , , Directed By: (2016) 88% #53 Adjusted Score: 88.183% Critics Consensus: Thirteen gives a well-worn premise an intriguing facelift with haunting execution and compelling performances across the board. Synopsis: A five-part drama miniseries that follows Ivy Moxam (Jodie Comer), a 26-year-old woman who escapes her kidnapper after thirteen years... Starring: , , , (2016) 87% #52 Adjusted Score: 87.043% Critics Consensus: Doctor Thorne provides a good prescription for those going through Downton Abbey withdrawls. Synopsis: Based upon Anthony Trollope's novel, this lavish drama follows Dr Thomas Thorne, and his charming niece Mary as she discovers... Starring: , , , (2017) 82% #48 Adjusted Score: 83.708% Critics Consensus: Heidi Thomas' Little Women miniseries offers a charming, intimate, and decidedly loyal adaptation of Louisa May Alcott's original story. Synopsis: Dramatisation of Louisa May Alcott's novel about the lives of the four March sisters during the American Civil War as... Starring: , , , (1982) 80% #47 Adjusted Score: 60.976% Synopsis: Evelyn Waugh's 1945 novel about an English aristocratic family inspired this multipart drama, among the most acclaimed miniseries ever produced.... Starring: , , , Directed By: (2008) #46 Synopsis: Adaptation of Dickens' serial novel about greed and financial corruption, chronicling the fates of a businessman and a girl born... Starring: , , , (2018) 89% #45 Adjusted Score: 90.978% Critics Consensus: Olivia Cooke's brilliant portrayal of the feisty and scheming Becky Sharp in Vanity Fair makes this adaptation of Thackeray's classic novel more relatable for a 21st century audience. Synopsis: A period drama series adapted from William Makepeace Thackeray's classic novel. Olivia Cooke is heroine Becky Sharp, who attempts to... Starring: , , , (2016) 80% #44 Adjusted Score: 81.782% Critics Consensus: Strong performances by Jenna Coleman and Rufus Sewell hint at Downton-esque potential for Victoria, but the narrative falls just shy of that soapy mark. Synopsis: It's not easy being queen, as young Victoria (Jenna Coleman) quickly learns upon her ascension, at the age of 18,... Starring: , , , Directed By: , Fantasy, Horror, and Supernatural (2008) 61% #43 Adjusted Score: 62.953% Critics Consensus: It's unabashedly soapy and it occasionally wavers in its social commentary, but True Blood is a gory, sexy genre romp with a strong supporting cast. Synopsis: In the not-too-distant future, vampires have come out of the coffin...no longer in need of a human fix. But can... Starring: , , , Directed By: , , , (2009) 55% #42 Adjusted Score: 56.004% Critics Consensus: This reimagining of Arthurian legend fails to conjure much excitement with its chintzy visual effects and soporific drama, but at least Colin Morgan imbues the titular wizard with an enchanting charm. Synopsis: The fantasy series, which offers a new spin on the Arthurian legend, opens with the teenage warlock Merlin (Colin Morgan)... Starring: , , , Directed By: , , , (1992) #41 Adjusted Score: -0.176% Synopsis: Popular fantasy-action adventures of Duncan MacLeod, an immortal who battles evil forces in complicated tales mixing modern-day stories with flashbacks... Starring: , , , Directed By: , , , (2017) 68% #40 Adjusted Score: 68.782% Critics Consensus: Subtle and spooky, Lore's horror-laden history lessons take on new life on the small screen, though it sticks too closely to the podcast's original format to truly distinguish itself. Synopsis: Based on the podcast phenomenon and narrated by creator Aaron Mahnke, this haunting six-episode anthology series is brought to life... Starring: , , , (2016) 58% #39 Adjusted Score: 48.415% Critics Consensus: This iteration of Beowulf will not inspire songs and epic poems in the years to come, with its heroic attempt at grounding the myth in an authentic reality dashed by corny stylization and unconvincing performances. Synopsis: Adventures of a troubled warrior living in a mythological place called the Shieldlands.... Starring: , , , (2013) 94% #38 Adjusted Score: 94.03% Critics Consensus: In the Flesh exists within several genres, growing into profound entertainment that haunts as it entertains. Synopsis: Kieren (Luke Newberry) returns to Roarton four years after committing suicide as a teenager, now a zombie suffering from PDS... Starring: , , , (2013) 82% #37 Adjusted Score: 85.248% Critics Consensus: Hannibal caters to an intellectual audience that prefers plenty of gore in its psychological thrillers, with a polished presentation of madness. Synopsis: Before SILENCE OF THE LAMBS, before RED DRAGON, Hannibal Lecter was a brilliant psychiatrist in the employ of the FBI.... Starring: , , , Directed By: , , , (2011) 68% #36 Adjusted Score: 68.908% Critics Consensus: Thanks to a charismatic lead in Tyler Posey and some dark, biting humor, Teen Wolf is a pleasant summer surprise, even if it does tread familiar ground. Synopsis: The first season of this remake of Michael J. Fox's 1985 cult classic follows Scott McCall (Tyler Posey) as he... Starring: , , , (2011) 54% #35 Adjusted Score: 55.671% Critics Consensus: Moody and dark, Grimm gives supernatural fantasy a TV procedural sheen. Synopsis: Nick Burkhardt (David Giuntoli) is a Portland, Oregon homicide detective with a strange secret: he's a descendant of an elite... Starring: , , , Directed By: , , , (2013) 100% #34 Adjusted Score: 101.51% Critics Consensus: A pleasant change from typically gory zombie shows, The Returned is a must-see oddity that's both smart and sure to disturb. Synopsis: Supernatural crime series is set in a quiet Alpine village.... Starring: , , , Directed By: , Mysteries and Thrillers (2013) 57% #30 Adjusted Score: 25.681% Synopsis: Shaun Evans plays Detective Constable Endeavour Morse in this prequel to \"Inspector Morse,\" the popular crime drama based on the... Starring: , , , Directed By: (2018) 79% #29 Adjusted Score: 82.265% Critics Consensus: Natalie Dormer charms in Picnic at Hanging Rock, a stylish retelling of an Australian classic -- though convoluted sub-plots at times distract from its otherwise tantalizing delights. Synopsis: Appleyard College becomes the epicenter for this mystery when three schoolgirls and a teacher go missing.... Starring: , , , Directed By: , (2014) 100% #28 Adjusted Score: 64.498% Critics Consensus: Grantchester is an easygoing sleuthing series that is satisfying as it is gentle, with a likable partnership between James Norton and Robson Green at its heart. Synopsis: The detective drama set in 1950s-era rural England begins with Anglican priest Sidney Chambers (James Norton) forging an unlikely partnership... Starring: , , , Directed By: , , (2015) 83% #27 Adjusted Score: 84.277% Critics Consensus: Fortitude's fine cast, deliberate pacing, and chilling setting provide the show with more than enough of the titular quality. Synopsis: A brutal murder is investigated in a small Arctic town.... Starring: , , , (2016) 91% #50 Adjusted Score: 94.452% Critics Consensus: The Night Manager's smart writing and riveting story are elevated all the more by Hugh Laurie and Tom Hiddleston's captivating performances. Synopsis: Jonathan Pine (Tom Hiddleston), a former British soldier turned night manager in a luxury hotel in Cairo, ends up in... Starring: , , , (2016) 67% #26 Adjusted Score: 67.043% Critics Consensus: The Kettering Incident pushes the boundaries of high-stakes, gripping mystery, albeit occasionally at the expense of deeper character development. Synopsis: When two girls disappear 15 years apart under identical circumstances, Dr Anna Macy (Elizabeth Debicki) discovers she is linked to... Starring: , , , Directed By: (2015) 67% #65 Adjusted Score: 67.897% Critics Consensus: Mad Dogs boasts exciting twists and a rich landscape, but occasionally squanders its talented actors on stale midlife-crisis observations. Synopsis: A group of forty-something friends travel to Belize for a celebration that turns into a nightmare and puts their bond... Starring: , , , Directed By: , , , (2018) 73% #25 Adjusted Score: 74.656% Critics Consensus: The ABC Murders liberally adapts the famed Agatha Christie mystery while retaining its thrilling spirit, thanks in part to the sly performance of John Malkovich, who inhabits Hercule Poirot with enough wizened panache to win over those who were skeptical of his casting. Synopsis: Set in the 1930s, the series follows the famous detective Poirot as he faces a serial killer known as A.B.C.... Starring: , , , (2018) 90% #49 Adjusted Score: 93.667% Critics Consensus: Escape at Dannemora's slow pace demands patience, but those willing to wait will be rewarded with a chilling mystery that provides the perfect showcase for its talented cast -- especially so for the incredible Patricia Arquette. Synopsis: Two inmates plot to escape from a correctional facility with the help of a female prison employee. This limited series... Starring: , , (2013) 65% #61 Adjusted Score: 66.188% Critics Consensus: Its trappings are nothing new and Its lurid combination of violence and sex will likely turn away some viewers, but Banshee can be entertaining in some distinctive ways. Synopsis: From Alan Ball, the creator of 'True Blood,' comes this thrilling Cinemax action series that charts the twists and turns... Starring: , , , Directed By: , , , (2018) 94% #24 Adjusted Score: 95.656% Critics Consensus: A classic British period piece that takes its time, Ordeal by Innocence will satisfy Agatha Christie fans and novices alike. Synopsis: The black sheep of the Argyll family resurfaces to deny accusations of killing the matriarch, which initiates the gang's hunt... Starring: , , , (2010) 91% #63 Adjusted Score: 91.893% Critics Consensus: Gritty and ambiguous, Luther is a captivating drama bolstered by a powerhouse performance from Idris Elba in the title role. Synopsis: Idris Elba, known for playing drug dealer Stringer Bell on \"The Wire,\" explores life on the other side of the... Starring: , , , Directed By: , (2008) 60% #23 Adjusted Score: 61.381% Critics Consensus: The setup and episodic storytelling is far from original, but The Mentalist distinguishes itself from other procedurals mostly due to the talents of Simon Baker. Synopsis: The first series of this crime drama finds Patrick Jane (Simon Baker) a former psychic, adjusting to his new job... Starring: , , , Directed By: , , , (2013) 95% #22 Adjusted Score: 95.287% Critics Consensus: Less sensationalistic and more provocative than most police procedurals, The Fall is unapologetically sexy with pressure-building tension driven by plausible characters and motifs. Synopsis: \"The Fall\" is a crime drama that follows an investigation into a series of murders involving young business women in... Starring: , , , Directed By: (2011) 75% #83 Adjusted Score: 75.526% Critics Consensus: Strike Back doesn't have much depth, but still offers a solid fix for viewers seeking an explosive espionage thriller. Synopsis: A high-octane, globe-spanning thriller with storylines ripped from today's headlines, Strike Back is a one-hour drama series that focuses on... Starring: , , , Directed By: , , , (2019) 67% #82 Adjusted Score: 69.466% Critics Consensus: A gritty reimagining of the 2011 film, Hanna adds new wrinkles to the mythology and texture to the titular assassin -- though the series' long-winded journey may try the patience of viewers who want their violent fables concise. Synopsis: In equal parts high-concept thriller and coming-of-age drama, HANNA follows the journey of an extraordinary young girl raised in the... Starring: , , , (2020) 78% #21 Adjusted Score: 79.259% Critics Consensus: Though The Pale Horse bristles with brutal thrills, it's convoluted mystery at times sedates the suspenseful proceedings. Synopsis: When a murder investigation is launched into the death of a young woman, a mysterious list of names is discovered... Starring: , , , (2016) 100% #20 Adjusted Score: 48.693% Synopsis: Police in a remote Icelandic town race against time to solve a murder case as a blizzard traps everyone in... Starring: , , , (2012) 100% #19 Adjusted Score: 36.241% Synopsis: A British anti-corruption unit called AC-12 investigates a Detective Chief Inspector's past.... Starring: , , , Directed By: (2018) 73% #18 Adjusted Score: 64.62% Critics Consensus: Though at times heavy-handed in its observations, Unforgotten's procedural premise is elevated by its humane approach. Synopsis: A stone-cold case of murder tests the wits of a crime-solving duo.... Starring: , , , Science-Fiction (2019) 100% #17 Adjusted Score: 103.354% Critics Consensus: A kaleidoscopic existential crisis, Undone bends the rules of space, time, and rotoscoping to weave a beautifully surreal tapestry that is at once fantastical and utterly relatable. Synopsis: From acclaimed creators Kate Purdy and Raphael Bob-Waksberg (BoJack Horseman) comes Undone, a groundbreaking and genre bending animated series about... Starring: , , , (1965) 100% #78 Adjusted Score: 100.435% Synopsis: An eccentric millionaire and his five sons make up an international rescue team who use a Thunderbird spacecraft to come... Starring: Directed By: (2015) 89% #16 Adjusted Score: 91.921% Critics Consensus: Humans is a mature, high-octane thriller offering emotional intrigue and thought-provoking suspense that should prove irresistible to sci-fi fans while remaining accessible enough to lure in genre agnostics. Synopsis: A suburban family buys the latest tech gadget--a robot servant--in this remake of a Swedish series. In Season 1 of... Starring: , , , Directed By: , (1963) 91% #15 Adjusted Score: 92.02% Critics Consensus: Not content to settle for Twilight Zone knockoff status, The Outer Limits set the bar for gruesome monster anthology series and stands the test of time. Synopsis: We are controlling transmission. ...' An eerie, fondly remembered sci-fi series that depicts paranormal paranoia with clever scripts and good... Starring: , , , (2017) 100% #14 Adjusted Score: 102.207% Critics Consensus: Tense and gripping, Counterpart is an absorbing thrill-fest led by J.K. Simmons' multi-faceted dual lead performance. Synopsis: Howard Silk (J.K. Simmons) is a lowly cog in the bureaucratic machinery of a Berlin-based United Nations spy agency. When... Starring: , , , Directed By: , (2013) 61% #13 Adjusted Score: 61.159% Critics Consensus: Defiance is watchable for its keen loyalty to science fiction and a well-told story. Synopsis: The series is set in the near future, where aliens known collectively as Votans have come to Earth seeking a... Starring: , , , (2004) 67% #12 Adjusted Score: 67.134% Synopsis: A team of explorers journeys to the mythical lost city, which was transported from Antarctica to the Pegasus galaxy by... Starring: , , , Directed By: , , , (1999) 100% #11 Adjusted Score: 80.911% Critics Consensus: Filled with humor and heart, Farscape effortlessly blends sci-fi set pieces and Jim Henson creations to create a space epic as thoughtful as it is thrilling. Synopsis: Cult favorite about an astronaut stranded light years from Earth in an alien war zone.... Starring: , , , Directed By: , , , (2012) 86% #10 Adjusted Score: 86.015% Critics Consensus: Continuum blends time-tested genre ingredients to deliver a sci-fi crime drama that's solidly entertaining despite its overall familiarity. Synopsis: In the first series of this Canadian crime drama, eight convicted terrorists escape their planned execution in the year 2077... Starring: , , , Directed By: Reality and documentaries (2019) 100% #9 Adjusted Score: 88.866% Synopsis: Professor Brian Cox explores the dramatic lives of the eight majestic worlds that make up our solar system.... Starring: (2015) 50% #8 Adjusted Score: 18.971% Synopsis: A docudrama chronicling the roots of New York City's Five Families and organised crime in America. Beginning in 1905 and... Starring: , , , (2018) 82% #6 Adjusted Score: 84.621% Critics Consensus: Fascinating and frustrating, Lorena's ample footage and fresh perspective on a long-mocked moment provide welcome context and vindication to the woman at its center -- even if its reenactments don't quite measure up. Synopsis: Directed by acclaimed documentary filmmaker Joshua Rofé (Lost for Life), Lorena reveals the hidden truths in the notorious case of... Starring: (1994) #5 Adjusted Score: -0.345% Synopsis: This stirring history of the sport first aired, conveniently, during a baseball strike, and it was the perfect antidote to... Starring: , , , (2012) #4 Synopsis: Chronicling the lives and achievements of some of the most influential figures in American history.... Starring: , , , Directed By: (2016) #1 Synopsis: All or Nothing is the first series to take viewers inside the locker room, on the sidelines, and off the... Starring: Thumbnail image: Nick Wall / ©AMC/Kudos/Channel 4, © Amazon Prime Video, ©MTV/Viacom Movie & TV News Featured on RT Top Headlines – – – – – – Tag Cloud Follow Us Copyright © 2018 Fandango. All rights reserved. | | Copyright © 2018 Fandango. All rights reserved."
  },
  {
    "url": "https://www.rottentomatoes.com/tv/were_here/s01/",
    "title": "We're Here: Season 1 - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Real Quick We want to hear what you have to say but need to verify your email. Don’t worry, it won’t take long. Please click the link below to receive your verification email. We want to hear what you have to say but need to verify your account. Just leave us a message and we will work on getting you verified. Please reference “Error Code 2121” when contacting customer service. > > Season 1 We're Here: Season 1 (2020) Season 1 We're Here Critics Consensus No consensus yet. TOMATOMETER Critic Ratings: 6 Audience Score User Ratings: 35 TOMATOMETER Average Rating: Avg Rating: /10 Total Count: Fresh: Rotten: The percentage of Approved Tomatometer Critics who have given this movie a positive review AUDIENCE SCORE 80% Average Rating: Avg Rating: 4.1/5 Total Count: 35 The percentage of users who rated this 3.5 stars or higher. Super Reviewer Verified Super Reviewer Verified Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) Super Reviewer Step 2 of 2 How did you buy your ticket? Let's get your review verified. By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You're almost there! Just confirm how you got your ticket. Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) How did you buy your ticket? By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You haven’t finished your review yet, want to submit as-is? You can always edit your review after. Are you sure? Verified reviews are considered more trustworthy by fellow moviegoers. Want to submit changes to your review before closing? Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. The image is an example of a ticket confirmation email that AMC sent you when you purchased your ticket. Your Ticket Confirmation # is located under the header in your email that reads \"Your Ticket Reservation Details\". Just below that it reads \"Ticket Confirmation#:\" followed by a 10-digit number. This 10-digit number is your confirmation number. Your AMC Ticket Confirmation# can be found in your order confirmation email. Episodes Air date: Apr 23, 2020 Series premiere. Bob the Drag Queen, Eureka O'Hara and Shangela Laquifa Wadley arrive in Gettysburg, Pa., to put on a one-night-only drag show featuring locals in need of a little support and empowerment, including: Hunter, a young, gay makeup artist yearning for a deeper connection with his father; Darryl, a local college admissions officer hoping to tell a story of race in America; and Erica, a conservative Christian mother eager to reconnect with her estranged daughter Hailey. Air date: Apr 30, 2020 Bob, Eureka and Shangela head west to Twin Falls, Idaho, a predominately Mormon community in Magic Valley. There, they meet Michael, Owen and Amelia, a group of local drag artists who need help forming a community. In order to do just that, the queens work with: Clifton, a straight musician trying to make amends for his past by testing his definition of masculinity; and Brandon, a trans man, and his wife, Mikayla, who are looking for the wedding experience they didn't have the first time around. Air date: May 7, 2020 In Branson, Mo., Bob, Eureka, and Shangela help three locals struggling to be their true selves in a community that prides itself on its traditional, religious values. Among them are Tanner, a young actor questioning whether it's possible for him to be both Christian and gay; Charles, a classically-trained dancer who wants to show that he's not just out, but proud; and Chris, a father grappling with mental health issues who's determined to embrace his emotions for the sake of his daughter. Air date: May 14, 2020 The queens journey into the desert to help the residents of Farmington and Shiprock, N.M., foster unity and open-mindedness. In the process, they enlist: Nate, a gay, indigenous photographer eager to make a deeper connection with his Navajo people; Nicole, a proud lesbian, public defender and local LGBTQ activist who's constantly misgendered because she wears \"men's\" clothes; and Stacey and Jasmine, a mother-daughter duo processing the traumatic suicide of their beloved daughter and sister DJ. Air date: May 21, 2020 Bob, Eureka, and Shangela head south to Ruston, La., to shake things up for a small town that's in need of some change. Among their drag children are: Jose, a young gay man tired of censoring himself in order to gain respect and acceptance; lifelong Ruston resident Stacy, an ex-firefighter and straight ally dedicated to using his influence to make his LGBTQ community members feel welcome; and Lynn, a tenacious, proud lesbian who is ready to dust off her old cowboy boots for her drag king debut. Air date: Jun 4, 2020 Tv Season Info Genre: Television Network: HBO Premiere Date: Apr 23, 2020 Exec. Producers: , , , , Cast News & Interviews for We're Here: Season 1 Episodes Air date: Apr 23, 2020 Series premiere. Bob the Drag Queen, Eureka O'Hara and Shangela Laquifa Wadley arrive in Gettysburg, Pa., to put on a one-night-only drag show featuring locals in need of a little support and empowerment, including: Hunter, a young, gay makeup artist yearning for a deeper connection with his father; Darryl, a local college admissions officer hoping to tell a story of race in America; and Erica, a conservative Christian mother eager to reconnect with her estranged daughter Hailey. Air date: Apr 30, 2020 Bob, Eureka and Shangela head west to Twin Falls, Idaho, a predominately Mormon community in Magic Valley. There, they meet Michael, Owen and Amelia, a group of local drag artists who need help forming a community. In order to do just that, the queens work with: Clifton, a straight musician trying to make amends for his past by testing his definition of masculinity; and Brandon, a trans man, and his wife, Mikayla, who are looking for the wedding experience they didn't have the first time around. Air date: May 7, 2020 In Branson, Mo., Bob, Eureka, and Shangela help three locals struggling to be their true selves in a community that prides itself on its traditional, religious values. Among them are Tanner, a young actor questioning whether it's possible for him to be both Christian and gay; Charles, a classically-trained dancer who wants to show that he's not just out, but proud; and Chris, a father grappling with mental health issues who's determined to embrace his emotions for the sake of his daughter. Air date: May 14, 2020 The queens journey into the desert to help the residents of Farmington and Shiprock, N.M., foster unity and open-mindedness. In the process, they enlist: Nate, a gay, indigenous photographer eager to make a deeper connection with his Navajo people; Nicole, a proud lesbian, public defender and local LGBTQ activist who's constantly misgendered because she wears \"men's\" clothes; and Stacey and Jasmine, a mother-daughter duo processing the traumatic suicide of their beloved daughter and sister DJ. Air date: May 21, 2020 Bob, Eureka, and Shangela head south to Ruston, La., to shake things up for a small town that's in need of some change. Among their drag children are: Jose, a young gay man tired of censoring himself in order to gain respect and acceptance; lifelong Ruston resident Stacy, an ex-firefighter and straight ally dedicated to using his influence to make his LGBTQ community members feel welcome; and Lynn, a tenacious, proud lesbian who is ready to dust off her old cowboy boots for her drag king debut. Air date: Jun 4, 2020 | | | The former is about documenting joy and discovery - something this show does well. The latter is about jerking tears, which is something this show strains to do. Apr 23, 2020 | Top Critic On a deeper level, it's a show about loving -- truly loving -- your neighbor. Apr 22, 2020 | Top Critic Regardless of motivation, or level of drag familiarity, We're Here is a charming and engaging reality series and one well worth watching. Apr 20, 2020 | Rating: A- | Top Critic The result... is some true fun. Apr 27, 2020 | If To Wong Foo had a tawdry hookup with The Adventures of Priscilla, Queen of the Desert and Queer Eye, HBO's We're Here would be the product nine months later. Apr 23, 2020 | We're Here is more than a drag show and more than a makeover show. It's an important watch that is just as sickening as it is heartwarming, and you're gonna want to have a box of tissues handy. Apr 23, 2020 | Audience Reviews for We're Here: Season 1 1d ago Phenomenal. Love and positivity in a time we need it most. 2d ago My only complain is that the episodes are too short! The transformations are so inspiring and heart breaking. I'm not typically cheesy but these towns and the individuals are so real and it just touches you. 3d ago Amazing cast, stories, and production. Beware of waterworks May 09, 2020 This is an entertaining show reminds me of the movie \"Too Wong Foo, Thanks for Everything! Julie Newmar.\" May 09, 2020 Never write reviews but want everyone to watch this show! It's about Love, Acceptance & Celebration! It will open hearts and break down walls! May 08, 2020 Wanted so much to like it, but it was trite and pandering. May 08, 2020 The best reallity show with drag queens since RuPaul's Drag Race. Perfect on everything: direction, script, editing, characters and with wonderful presenters/hosts. Unpretentious, sensitive, remarkable. May 07, 2020 heartfelt, fun and educational. A roller-coaster hour of tv. May 01, 2020 So heartfelt and emotional. Gives you all the feels. Apr 30, 2020 Hooked from the first episode. A must watch for any RPDR fan, but a great show in general. Bob is, as always, and forever, amazing. Shangela is such a great performer and really has a radiance that sticks with you. Eureka just can't help but be hilarious. This is the budget and production that these artists deserve. This is the transformation and inclusion that these participants deserve. This is the spin-off that stans deserve. I give this show a Shoot! News & Features TOP HEADLINES – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes Opening Top Box Office Coming Soon Top DVD & Streaming New On DVD/Streaming This Week New TV Tonight Most Popular TV on RT Certified Fresh TV About Tomatometer The percentage of Approved Tomatometer Critics who have given this movie a positive review About Audience Score The percentage of users who rated this 3.5 stars or higher. Go back"
  },
  {
    "url": "https://www.rottentomatoes.com/browse/dvd-streaming-all/?services=fandango_now",
    "title": "Top Movies - Netflix, Amazon, iTunes, DVD | Rotten Tomatoes",
    "description": "Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT IN THEATERS DVD & STREAMING MOVIES TV Movies and TV shows are Certified Fresh with a steady Tomatometer of 75% or higher after a set amount of reviews (80 for wide-release movies, 40 for limited-release movies, 20 for TV shows), including 5 reviews from Top Critics. BROWSE ALL DVDS & STREAMING IN THEATERS DVD & STREAMING MOVIES TV Show me movies available on... FandangoNOW Netflix Streaming iTunes Amazon Prime Amazon HBO Vudu Tomatometer Certified Fresh only Action Animation Art & Foreign Classics Comedy Documentary Drama Horror Kids & Family Mystery Romance Sci-fi & Fantasy Release Date Tomatometer Popularity Showing of Search Filter Show me movies available on... FandangoNOW Netflix Streaming iTunes Amazon Prime Amazon HBO Vudu 0% - 100% Tomatometer Certified Fresh only Genre Action Animation Art & Foreign Classics Comedy Documentary Drama Horror Kids & Family Mystery Romance Sci-fi & Fantasy Sort By:"
  },
  {
    "url": "http://www.facebook.com/rottentomatoes",
    "title": "Rotten Tomatoes - Home | Facebook",
    "description": "Jump toPress alt + / to open this menuEmail or PhonePassword2M followersServing up Fresh and Rotten reviews for movies and TV.Groups559 membersThe Ketchup is a recurring deep dive into the most exciting movie and TV news stories. Below are a few house rules: 1. We value the diverse opinions of our , so you may find points of view that you don't agree with. And that's cool. However, there are certain things we're not OK with: Attempts to manipulate our data in any way, for example, or the posting of offensive, hateful, or disparaging material – and we reserve the right to restrict or deny your ability to participate in our community if we believe you are doing so. 2. You've got opinions! You're eager to share! We understand. But please keep those opinions focused on our show. Posts about are not appropriate \"The Ketchup\" content and will be removed. 3. Don't display behavior that could be described as trolling – things like starting quarrels or upsetting people by posting inflammatory or off-topic messages 4. If a group member starts a discussion that all other members disagree with, it may, at the discretion of the group admin, be viewed as trolling and will be removed. 5. We encourage debate, but not trolling. Be respectful of fellow fans. An initial warning of uncouth behavior will be given at the discretion of the admins, but we reserve the right to enforce a zero-tolerance policy. 6. Regardless of the adult themes and situations, some of the films and shows we will cover contain, no graphic photos or videos are allowed. This includes and extreme violence. 7. Don't use obscenities or profanity directed at individuals, brands, or companies, including name-calling or personal attacks. 8. Don't express hatred or intolerance for people based on religion, gender or gender identity, sexual orientation, , ethnicity, nationality, age, or disability. And don't promote organizations with such views. 9. Do not promote other groups, your blog, or business on this group. 10. are A-Okay here – we'll try not to spoil a film or show for you, but you are free to spoil and speculate here 11. Again, Rotten Tomatoes is allowed to deny entry into the group to any member group admins choose. If you repeatedly break our rules, including posting profane language or abusive comments, you will be kicked out at the discretion of Rotten Tomatoes admins. For more information please see our FAQ and Community Code of Conduct. http://bit.ly/rtfaqpage http://bit.ly/rtcodeofconduct27,379 membersRules & Regulations 1. This is a spoiler-friendly realm for Game of Thrones discussion and debate. We invite members to openly speculate about an upcoming episode based on trailers, to share wish-lists for plot points you would like to see, to discuss the episode as it is airing, review details of a just-aired episode, and so on. Participants are hereby forewarned that visiting the group when an episode is airing in another time zone may result in spoilage – enter at your own risk. 2. On pain of banishment from the realm, do not post anything that’s not Game of Thrones related in this group. “Thanks for the add” ravens are welcome, but the crown encourages you to dress it up with some Thrones heraldry. 3. Do not shill for other groups, your blog, business, or enemy banners on this group. 4. Mild profanity such as “badass,” “kick ass,” “that’s the shit,” is allowed; however, curses should never be directed abusively at another group member. Doing so will almost certainly result in the proverbial boot. 5. Racial or gender slurs are never allowed. Period. Do not test this point. 6. Despite the series’ adult themes and situations, no graphic photos or videos are allowed. This includes porn and extreme violence – yes, even from the show. 7. Show nobility toward other group members. We encourage debate, but not trolling. Be respectful of fellow fans. An initial warning of Wildling-like behavior will be given at the discretion of the admins, but we reserve the right to enforce a zero-tolerance policy. 8. If group member starts a discussion that all other members disagree with, it may, at the discretion of the group admin, be viewed as trolling. Trolls will be banished. 9. Be aware that creating more than 5 posts on the same day needs to be justified to the group admin, or it will be considered spam and eliminated. No, you may not request a trial by combat. 10. If a group admin or another member has deleted your comment, suffer it in silence. Excessive whining may lead to banishment. 11. Any concerns or complaints should be sent in a private message to group admin or the Rotten Tomatoes page, and are not to be addressed publicly on this forum. See above “excessive whining” warning. 12. Note that any content you create and share in the group may be shared to the Rotten Tomatoes Facebook page, or any other social pages under the Fandango network. By posting here you agree to let us share your content. 13. Rotten Tomatoes is allowed to deny entry into the group to any member group admins choose. If you repeatedly break the laws of our GoT realm, including posting profane language or abusive comments, you will be kicked out at the discretion of Rotten Tomatoes admins. 14. This is an English-language group. The crown asks that you please post in English. 15. You've got opinions! You're eager to share! We understand. But please keep those opinions focused on GoT. Posts about politics are not appropriate Debate of Thrones content and will be removed. Community1,859,668 people like this2,019,819 people follow thisPage TransparencyFacebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content.Page created - January 25, 2008PeoplePages Liked by This PageRelated PagesEntertainment WebsiteTV NetworkVideo GameNonprofit OrganizationMovie/Television StudioEntertainment WebsiteMovie/Television StudioMovieCompanyProduct/ServiceTV NetworkArts & EntertainmentMedia/News CompanyProduct/ServiceMedia/News CompanyFan PageComedianArts & EntertainmentMovieTV ShowEnglish (US) · · · · · · · · · Facebook © 2020Photos"
  },
  {
    "url": "https://www.rottentomatoes.com/tv/i_know_this_much_is_true/s01",
    "title": "I Know This Much Is True: Season 1 - Rotten Tomatoes",
    "description": "| Movies in Theaters More Certified Fresh Picks New TV Tonight Most Popular TV on RT More Episodic Reviews Certified Fresh Pick Columns Best and Worst Guides RT News Trending on RT Sign In OR Email address Password Don't have an account? Sign up for Rotten Tomatoes or First Name Last Name Email Password By signing up, you agree to receiving newsletters from Rotten Tomatoes. You may later unsubscribe. Already have an account? By creating an account, you agree to the and the , and to receive email from Rotten Tomatoes and Fandango. Forgot your password Please enter your email address and we will email you a new password. Email Address Real Quick We want to hear what you have to say but need to verify your email. Don’t worry, it won’t take long. Please click the link below to receive your verification email. We want to hear what you have to say but need to verify your account. Just leave us a message and we will work on getting you verified. Please reference “Error Code 2121” when contacting customer service. > > Season 1 I Know This Much Is True: Season 1 (2020) Season 1 I Know This Much Is True Critics Consensus I Know This Much is True's relentlessly grim plotting makes it a difficult watch, but the strength of Mark Ruffalo's dual performances is enough to make it a dark tale worth tuning into. TOMATOMETER Critic Ratings: 47 Audience Score User Ratings: 37 TOMATOMETER Average Rating: Avg Rating: /10 Total Count: Fresh: Rotten: The percentage of Approved Tomatometer Critics who have given this movie a positive review AUDIENCE SCORE 78% Average Rating: Avg Rating: 4/5 Total Count: 37 The percentage of users who rated this 3.5 stars or higher. Super Reviewer Verified Super Reviewer Verified Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) Super Reviewer Step 2 of 2 How did you buy your ticket? Let's get your review verified. By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You're almost there! Just confirm how you got your ticket. Super Reviewer Rate this season Oof, that was Rotten. Meh, it passed the time. It’s good – I’d recommend it. Awesome! So Fresh: Absolute Must See! What did you think of this tv season? (optional) How did you buy your ticket? By opting to have your ticket verified for this movie, you are allowing us to check the email address associated with your Rotten Tomatoes account against an email address associated with a Fandango ticket purchase for the same movie. You haven’t finished your review yet, want to submit as-is? You can always edit your review after. Are you sure? Verified reviews are considered more trustworthy by fellow moviegoers. Want to submit changes to your review before closing? Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. Done Already? A few more words can help others decide if it's worth watching They won't be able to see your review if you only submit your rating. The image is an example of a ticket confirmation email that AMC sent you when you purchased your ticket. Your Ticket Confirmation # is located under the header in your email that reads \"Your Ticket Reservation Details\". Just below that it reads \"Ticket Confirmation#:\" followed by a 10-digit number. This 10-digit number is your confirmation number. Your AMC Ticket Confirmation# can be found in your order confirmation email. Episodes Air date: May 10, 2020 Series premiere. Paranoid schizophrenic Thomas Birdsey has a violent public breakdown, and Dominick Birdsey finds himself stepping up to defend his identical twin brother in unexpected ways. As he navigates the fallout of Thomas' actions, Dominick reflects on their childhood growing up under the tyrannical rule of their volatile stepfather, Ray, and their persistent desire to know the identity of their biological father. Air date: May 17, 2020 Tensions rise between Dominick and his live-in girlfriend, Joy, as the media begins to take an interest in Thomas' case. In his attempt to have Thomas released from the Hatch forensic institute for the criminally insane, Dominick finds a potential ally in social worker Lisa Sheffer, but learns that helping his brother may be more difficult than he thought. Dominick clashes with Thomas' new psychiatrist, Dr. Patel, as she begins to probe into his past. Air date: May 24, 2020 Sheffer preps Dominick for a pivotal hearing with Hatch's review board that could decide Thomas' fate. A chance encounter with an old classmate brings painful childhood memories to the surface. Dominick reflects on his and Thomas' time together at college, during which he met Dessa and the signs of his brother's illness first began to manifest. Joy attempts to remedy the problems in her and Dominick's relationship. Air date: May 31, 2020 Despite the protestations of those closest to him, Dominick returns to work before fully recovering from his accident. Heavily medicated, Dominick recalls the disturbing incident that lead to Thomas' first hospitalization while counting down the hours to Thomas' hearing with the Hatch review board. Air date: Jun 7, 2020 I Know This Much Is True: Season 1 Videos Tv Season Info Genre: Drama Network: HBO Premiere Date: May 10, 2020 Exec. Producers: , , , , , , , Cast as Joy Hanks as Ray Birdsey as Dominick Birdsey/Thomas Birdsey (young adult) News & Interviews for I Know This Much Is True: Season 1 Episodes Air date: May 10, 2020 Series premiere. Paranoid schizophrenic Thomas Birdsey has a violent public breakdown, and Dominick Birdsey finds himself stepping up to defend his identical twin brother in unexpected ways. As he navigates the fallout of Thomas' actions, Dominick reflects on their childhood growing up under the tyrannical rule of their volatile stepfather, Ray, and their persistent desire to know the identity of their biological father. Air date: May 17, 2020 Tensions rise between Dominick and his live-in girlfriend, Joy, as the media begins to take an interest in Thomas' case. In his attempt to have Thomas released from the Hatch forensic institute for the criminally insane, Dominick finds a potential ally in social worker Lisa Sheffer, but learns that helping his brother may be more difficult than he thought. Dominick clashes with Thomas' new psychiatrist, Dr. Patel, as she begins to probe into his past. Air date: May 24, 2020 Sheffer preps Dominick for a pivotal hearing with Hatch's review board that could decide Thomas' fate. A chance encounter with an old classmate brings painful childhood memories to the surface. Dominick reflects on his and Thomas' time together at college, during which he met Dessa and the signs of his brother's illness first began to manifest. Joy attempts to remedy the problems in her and Dominick's relationship. Air date: May 31, 2020 Despite the protestations of those closest to him, Dominick returns to work before fully recovering from his accident. Heavily medicated, Dominick recalls the disturbing incident that lead to Thomas' first hospitalization while counting down the hours to Thomas' hearing with the Hatch review board. Air date: Jun 7, 2020 | | | Seeing actors do what they do best, with Cianfrance giving them the space to do it, makes I Know This Much is True a real feast. May 8, 2020 | Rating: 3.5/4 | Top Critic It's not Ruffalo's fault - he's great here - but the material is spread too thin over too much canvas, then culminates in too banal a \"truth.\" In a word, it's as dull as it is grim. May 7, 2020 | Rating: 2/4 | Top Critic Each brother could become a showy caricature of their written selves, and yet [Ruffalo] lives in the small, quiet moments as well as big, explosive outbursts. May 7, 2020 | Rating: B | Top Critic \"I Know This Much Is True\" misses the mark in terms of storytelling. It just sits there, a roiling mass of misery that fails to provide you with a compelling reason to keep watching. May 7, 2020 | Top Critic I'm almost afraid to say it because it's so obvious, but Ruffalo is very good. May 13, 2020 | Rating: 3/5 | Top Critic Ruffalo does angry like Bambi does cute. May 12, 2020 | Rating: 4/5 | Top Critic I Know This Much is True, adapted and directed by Derek Cianfrance, is undeniably heavy going. What makes it tolerable is Ruffalo, whose dual performance... is so good that you often forget you're watching just one actor. May 15, 2020 | Rating: 3/5 | A different set of circumstances does not fix the miniseries, just as being more or less hungry does not fix an overcooked rice. [Full Review in Spanish] May 13, 2020 | Rating: 2.5/5 | But while it may be a painful viewing experience in the beginning, not because it is bad but because it is just so sad, with destruction comes renovation. And we all know, that much is true. May 13, 2020 | Rating: 4/5 | It's a stark, if lurid, illustration of the challenges, choices and burdens imposed by mental illness. May 12, 2020 | Rating: 3/5 | [Derek] Cianfrance directs like a filmmaker without constraints, even touching on a bit of surrealism with a hospital hallucination that has the real, authentic feeling of the subconscious at work. May 12, 2020 | A poetic look at mental illness, grief, generational trauma, and guilt made all the more visceral by Cianfrance's style and Ruffalo's transcendent performance. May 12, 2020 | Audience Reviews for I Know This Much Is True: Season 1 1d ago Anything with the new Kathryn Hahn deserves to be deleted. Makes casting so transparent that you do not have the opportunity to lose yourself in the narrative.More like, Oh look at me, I'm still employed. If necessary, I can play a scarecrow in some Midwestern drama. 2d ago Have only seen the first episode so far and I love it! The performances all around were great, especially Mark Ruffalo as the Birdsey twins in what probably his best career performance(s) topping the likes of You Can Count on Me, What Doesn't Kill You, The Kids Are All Right, The Normal Heart, Zodiac and even Spotlight, Foxcatcher and Dark Waters combined. He truly carries this show on his shoulders. I also love the set and the cinematography. The story so far is very faithful to the book and I'm very excited to see what's in store for these characters in the remaining 5 episodes. 2d ago I'm absolutely stuck in this miniseries, in a nice way, even if it's a tragic story. It is a first-rate drama. Mark Ruffalo, who is arguably an excellent actor, exceeds all expectations. He's absolutely brilliant in the role of twins. 3d ago Absolutely gut wrenching.. Perfectly shows the absurdity of world, so intriguing..beautiful camera works. Mark Ruffalo is pure gem, also brilliant performance by rest of the cast.. 4d ago Even though only the first episode has aired, I can safely say that this is my new favorite HBO show. It's from the writer/director of \"Blue Valentine\" (yep, it's gonna be that sad) and \"The Place Beyond The Pines\" (yes, it's that underrated) and stars Mark Ruffalo and Melissa Leo and the top of their games (especially Ruffalo, who truly earns his Oscar here). The dialogue feels real, and portrays a humorous levity to the hardcore drama onscreen. It's pretty surprising, too. Not quite as good as the two PERFECT films listed above, but MUCH better than \"The Light Between Oceans\". It's a must-watch. 9.5/10 4d ago I'm impressed Cianfrance et al. stuck so closely to Wally Lamb's novel. The series is opening up like a flower or a maze, just as it should. This may be the performance of Mark Ruffalo's career: sensitive and withdrawn as Thomas; hurt and hyper masculine as Dominick. He really carries this drama of family ties and responsibilities in his capable hands. The supporting cast is also topnotch and rises to the occasion in every scene. I've read some critics kvetching over the locations being \"too gritty\" or \"gloomy,\" but the sets looked period accurate as if you knew and remembered them. Three Rivers is supposed to appear lived-in and real, yet loved and familiar as well. The cinematography is stunning and evokes the feel of the 1990s in a small, working-class city. Likewise, I'm losing my patience with folks who have not read the novel complaining about how brutal and depressing the story is because they wanted some feel-good pablum to watch and forget. Honey, this is the Jungian cave you've entered, and we're going to the bottom before we come out into enlightenment. Not going to spoil it, but Dominick will literally have to be broken and rebuild himself (with help) from the ground up. Trust me, it's going to be worth it! 5d ago Mark's acting is next level. He deserves so many performance awards for this. 5d ago It's a pretty good show. I would recommend it. 5d ago It's amazing! Mark Ruffalo dropped his best performance. 5d ago I mean do I love Ruffalo? Yes. Do I like the choices he makes? Usually. Did I like this? NO! I'm disappointed this wasn't more compelling. At the same time, I appreciate the work. The way the episodes are told though and the way it is shot is super boring. News & Features TOP HEADLINES – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes – Rotten Tomatoes Opening Top Box Office Coming Soon Top DVD & Streaming New On DVD/Streaming This Week New TV Tonight Most Popular TV on RT Certified Fresh TV About Tomatometer The percentage of Approved Tomatometer Critics who have given this movie a positive review About Audience Score The percentage of users who rated this 3.5 stars or higher. Go back"
  },
  {
    "url": "http://fandango.custhelp.com/app/new_ask",
    "title": "Contact Customer Service",
    "description": "THEATER CLOSURES: If you are reaching out for a refund, please note that we are actively processing refunds for cancelled showings/theater closures. You will receive a full refund. It may take up to two weeks for the funds to return to your account. If you do not receive your refund in two weeks, please contact us again. Submit a question to our support team. Please allow up to 72 hours to receive a response. Need a refund or exchange? If you're a Fandango VIP member, go to your and click the \"Can't Make The Show\" link next to your order. If you don't have a VIP account, using the same email address that you used to purchase your tickets. You can also . For details read . To contact our support team directly, please call 1-800-FANDANGO. Category: * Required Email Address * First Name Last Name * Question * Theater Name, City, State Confirmation # CardType For refunds and exchanges, go to your and click the \"Can't Make The Show\" link next to your order. You can also . Copyright © 2017 Fandango. All rights reserved."
  },
  {
    "url": "http://www.fandango.com/RedirectHelp.aspx",
    "title": "Fandango | Page Not Found",
    "description": "Error 404: page not found Hold up Looks like the page you are looking for cannot be found"
  },
  {
    "url": "http://www.fandango.com/",
    "title": "Movie Tickets & Movie Times | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Movie Tickets and Times Now Playing & Coming Soon Fri, Feb 21 Previous Next"
  },
  {
    "url": "http://www.fandango.com/Advertising.aspx",
    "title": "Advertise With Us | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Advertising Fandango, the nation's leading moviegoer destination, sells tickets to more than 26,000 screens nationwide. Fandango entertains and informs consumers with trailers, original video content, reviews, commentary, and celebrity interviews, and offers the ability to quickly select a film, plan where and when to see it, and conveniently buy tickets in advance. At many theaters, fans can print their tickets at home or receive them as a mobile ticket on their smartphones.Fandango is available online at , via smartphones and tablets. Fandango's top-ranking movie ticketing app, with nearly 40 million downloads, is available on iPhone, iPad, Android, and Windows. Fandango is enjoyed by more than 26 million online and mobile visitors per month. Film fans find Fandango on Facebook at and on Twitter .Fandango's founding partners include the nation's leading exhibitors: AMC Theatres, Carmike Cinemas, Century Theatres, Cinemark Theatres, Edwards Theatres, Regal Cinemas, Regal Entertainment Group and United Artists Theatres, as well as American Cinematheque, Bartlett Cinemas, Brenden Theatres, CineArts Theatres, Cinebarre, Cinebistro, Cinelux Theatres, City Base Cinemas, Cityplex, Cinemas Palme d'or, Cinetopia, Cobb Theatres, Flagship Theaters, Georgia Theater Company, Kerasotes Theatres, King Theatre Circuit, Krikorian Premiere Theatres, Memphis, Pacific Theatres, Penn Cinemas, Premiere Theatres, Reading Cinemas, R/C Theatres, Regency, Southern, Starlight Cinemas, Studio Movie Grill, Tristone, Wehrenberg Theatres and Winchester Theatres.Fandango's extremely loyal, affluent, and action-oriented audience creates a powerful and attractive target for advertisers.Advertising OpportunitiesPlease fill out our online form and a Fandango sales person will contact you with additional information.For information regarding in-theater advertising, please contact our partner theaters directly. ."
  },
  {
    "url": "https://www.fandango.com/antebellum-221718/movie-overview",
    "title": "Antebellum | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Antebellum Opens August 21, 2020 Suspense/Thriller Tell us where you are Looking for movie tickets? Enter your location to see which movie theaters are playing Antebellum near you. ENTER CITY, STATE OR ZIP CODE Fandango FANALERT® This movie releases on August 21, 2020. Sign up for a FANALERT® and be the first to know when tickets and other exclusives are available in your area. Also sign me up for FanMail to get updates on all things movies: tickets, special offers, screenings + more. Antebellum: Trailer 1 1 of 2 Antebellum Synopsis Successful author Veronica Henley (Janelle Mona´e) finds herself trapped in a horrifying reality and must uncover the mind-bending mystery before it’s too late. Cast + Crew Director Director Veronica Nick Features Movie Reviews Presented by Rotten Tomatoes X"
  },
  {
    "url": "https://www.fandango.com/movie-news",
    "title": "Movie News - Learn about Top New Movies | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Movie News Fandango Guides Previous Next Latest News"
  },
  {
    "url": "http://www.fandango.com/careers/",
    "title": "Careers at Fandango | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Careers at Fandango About Fandango Fandango is the ultimate digital network for all things movies, serving more than 60 million unique visitors per month, according to comScore. Its portfolio features leading online ticketers Fandango, MovieTickets and Flixster; world-renowned movie review site Rotten Tomatoes; and the Movieclips multichannel network on YouTube. Fandango's movie discovery and ticketing innovations can also be found on mobile, social, AI bot and voice platforms from Apple, Facebook, Google, Amazon, and others. Video on-demand service, FandangoNOW offers new release and catalog movies and next-day TV shows to more than 200 million connected, over-the-top (OTT) and mobile devices. In Latin America, the company operates leading online ticketers Ingresso and Fandango Latin America. So, if you're looking to inspire, be inspired and work at the intersection of entertainment and technology look no further than Fandango. for the latest news and updates. Fandango is an NBCUniversal Company. It is the policy of NBCUniversal and NBCUniversal's affiliated businesses to consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by law. Benefits Health We want our employees to feel awesome. Want proof? We offer free membership to our on premise gym and on-site fitness classes. In addition to the more traditional options in medical, dental, and vision programs, we also host the occasional massage day, in-house flue shots, and manage a private Doctor on Demand room. Time Off We believe work life balance is essential. Full time employees get 10 vacation days, 2 floating holidays, 5 personal days, and 11 sick days a year. If that isn't enough, when the weather warms up, we often participate in a Summer Friday program. Flex Schedule Not everyone works on the same schedule. This is why we offer flexible work arrangements and hours for certain roles. Well-Certified Fandango is a WELL certified office! That means our office is built to positively impact our health and wellbeing through our air and water quality, ergonomic comforts, acoustics, and light design. Knowledge is Power Enhance the skills you got, or learn something new! Engage in our tech meet-ups, or take advantage of NBCU's tuition reimbursement program. 401K We match 100% of the first 6% (Fully vested after 2 years). We offer an additional 100% up to 1.5% (vested over 6 years) regardless of your participation in the 401(K). Fandango In Action Perks Food Our kitchen is stocked with a variety of healthy breakfast, snack and beverage options... not to mention catered lunches every Tuesday & Thursday! Entertainment Movies are an integral part of our lives at Fandango. We provide generous promo codes for our Fandango and FandangoNOW platforms so our empoyees can enjoy the cinematic experience in theatres and at home! Humanitarian Fandango loves to give back! We collaborate with our corporate partners, NBCUniversal and Comcast, on community outreach projects. Keep an eye out for volunteer opportunities to participate in throughout the year. Events Seasonal parties, holiday soirees, occasional happy hours & celebrations are just a few of the ways we like to treat our employees for jobs well done. Organizations Tech Women Comcast NBCUniversal TECHWomen provides a forum for female technologists and their allies to CONNECT with one another across the enterprise, CONTRIBUTE to the broader technology and innovation strategy, and INSPIRE a deeper impact within our company and communities. The Fandango chapter consists of various professional networking events, STEM Community Outreach, and a mentorship program. All employees are welcome to join and participate! Summer Intern Program Fandango offers an extensive summer internship program. No coffee runs or copy making here! Our interns are immersed into various departments and get real, hands-on work. They regularly work with peers, managers, and executives. In addition to the real-life projects, interns have a full schedule of events as part of the summer program. This consists of multiple lunch and learns, where they get to meet and hear from different company leaders over lunch. We also have a fun day, philanthropic day, mixer with NBCU, and lunch with our CEO, Paul Yanover! This provides plenty of opportunities to make connections and get advice from professionals in different fields that an intern may have a passion for."
  },
  {
    "url": "https://www.fandango.com/movie-photos/2020-award-red-carpets-1386",
    "title": "2020 Award Red Carpets | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? 2020 Award Red Carpets 2020 Award Red Carpets 2020 Oscars Renee Zellweger Getty Images 2020 Oscars Brad Pitt Getty Images 2020 Oscars Cynthia Erivo Getty Images 2020 Oscars Rooney Mara and Joaquin Phoenix Getty Images 2020 Oscars Taika Waititi Getty Images 2020 Oscars Bong Joon-ho Getty Images 2020 Oscars Choi Woo-shik, Kang-Ho Song, Lee Sun Gyun, Park So-dam, Cho Yeo-jeong, Lee Jeong-eun, Jang Hye-jin and Park Myung-hoon Getty Images 2020 Oscars Diane Ladd and Laura Dern Getty Images 2020 Oscars Scarlett Johansson Getty Images 2020 Oscars Charlize Theron Getty Images 2020 Oscars Regina King Getty Images 2020 Oscars Leonardo DiCaprio Getty Images 2020 Oscars Margot Robbie Getty Images 2020 Oscars Robert De Niro and Al Pacino Getty Images 2020 Oscars Noah Baumbach and Greta Gerwig Getty Images 2020 Oscars Florence Pugh Getty Images 2020 Oscars Saoirse Ronan Getty Images 2020 Oscars Natalie Portman Getty Images 2020 Oscars Olivia Colman Getty Images 2020 Oscars Mahershala Ali and Amatus Sami-Karim Getty Images 2020 Oscars Lucy Boynton and Rami Malek Getty Images 2020 Oscars Quentin Tarantino Getty Images 2020 Oscars Beanie Feldstein Getty Images 2020 Oscars Kaitlyn Dever Getty Images 2020 Oscars Vanessa Nadal and Lin-Manuel Miranda Getty Images 2020 Oscars Zazie Beetz Getty Images 2020 Oscars Janelle Monae Getty Images 2020 Oscars Sunrise Coigney and Mark Ruffalo Getty Images 2020 Oscars Geena Davis and Sandra Oh Getty Images 2020 Oscars Tonya Lewis Lee and Spike Lee Getty Images 2020 Oscars George MacKay and Dean-Charles Chapman Getty Images 2020 Oscars Julia Butters Getty Images 2020 Oscars Roman Griffin Davis and Archie Yates Getty Images 2020 Oscars Elvira Lind and Oscar Isaac Getty Images 2020 Oscars Penelope Cruz Getty Images 2020 Oscars Salma Hayek Getty Images 2020 Oscars Brie Larson Getty Images 2020 Oscars Tom Hanks and Rita Wilson Getty Images 2020 Oscars Idina Menzel Getty Images 2020 Oscars Gal Gadot Getty Images 2020 SAG Awards Charlize Theron and Brad Pitt Getty Images 2020 SAG Awards Joaquin Phoenix Getty Images 2020 SAG Awards Renee Zellweger Getty Images 2020 SAG Awards Robert De Niro and Meryl Streep Getty Images 2020 SAG Awards Laura Dern and Noah Baumbach Getty Images 2020 SAG Awards Scarlett Johansson Getty Images 2020 SAG Awards Adam Driver Getty Images 2020 SAG Awards Margot Robbie Getty Images 2020 SAG Awards Lupita Nyong'o Getty Images 2020 SAG Awards Cynthia Erivo Getty Images 2020 SAG Awards Jennifer Lopez Getty Images 2020 SAG Awards Nicole Kidman Getty Images 2020 SAG Awards Kang-ho Song, Hye-jin Jang, Ji-so Jung, Sun-kyun Lee, Woo-sik Choi and Bong Joon Ho Getty Images 2020 SAG Awards Taika Waititi Getty Images 2020 SAG Awards ) Quentin Tarantino, Jamie Foxx and Bruce Dern Getty Images 2020 SAG Awards Al Pacino Getty Images 2020 SAG Awards Tom Hanks and Rita Wilson Getty Images 2020 SAG Awards Margaret Qualley Getty Images 2020 SAG Awards Dakota Fanning Getty Images 2020 SAG Awards Kaitlyn Dever Getty Images 2020 Critics' Choice Awards Laura Dern Getty Images 2020 Critics' Choice Awards Rain Phoenix and Joaquin Phoenix Getty Images 2020 Critics' Choice Awards Saoirse Ronan and Greta Gerwig Getty Images 2020 Critics' Choice Awards Jennifer Lopez Getty Images 2020 Critics' Choice Awards Adam Driver Getty Images 2020 Critics' Choice Awards Renee Zellweger Getty Images 2020 Critics' Choice Awards Awkwafina Getty Images 2020 Critics' Choice Awards Charlize Theron Getty Images 2020 Critics' Choice Awards Nicole Kidman Getty Images 2020 Critics' Choice Awards Cynthia Erivo Getty Images 2020 Critics' Choice Awards Lupita Nyong'o Getty Images 2020 Critics' Choice Awards Florence Pugh Getty Images 2020 Critics' Choice Awards Keegan-Michael Key and Eddie Murphy Getty Images 2020 Critics' Choice Awards Song Kang-Ho, Lee Jung Eun, Han Jin Won, Yang Jinmo, Lee Ha-Jun, Kwak Sin Ae and Bong Joon-ho Getty Images 2020 Critics' Choice Awards Olivia Wilde, Kaitlyn Dever and Margaret Qualley Getty Images 2020 Critics' Choice Awards Anne Hathaway Getty Images 2020 Critics' Choice Awards Taika Waititi Getty Images 2020 Critics' Choice Awards Andrew Scott Getty Images 2020 Critics' Choice Awards Zendaya Getty Images 2020 Critics' Choice Awards Alison Brie, Betty Gilpin and Beanie Feldstein Getty Images 2020 Golden Globes Nicole Kidman, Renée Zellweger and Scarlett Johansson Getty Images 2020 Golden Globes Leonardo DiCaprio and Brad Pitt Getty Images 2020 Golden Globes Glenn Close and Jennifer Lopez Getty Images 2020 Golden Globes Jennifer Lopez Getty Images 2020 Golden Globes Awkwafina Getty Images 2020 Golden Globes Ana de Armas Getty Images 2020 Golden Globes Joaquin Phoenix Getty Images 2020 Golden Globes Chris Evans Getty Images 2020 Golden Globes Taron Egerton Getty Images 2020 Golden Globes Greta Gerwig and Noah Baumbach Getty Images 2020 Golden Globes Tom Hanks and Rita Wilson Getty Images 2020 Golden Globes Joanne Tucker and Adam Driver Getty Images 2020 Golden Globes Cynthia Erivo Getty Images 2020 Golden Globes Saoirse Ronan Getty Images 2020 Golden Globes Charlize Theron Getty Images 2020 Golden Globes Margot Robbie Getty Images 2020 Golden Globes Daniel Craig Getty Images 2020 Golden Globes Taika Waititi Getty Images 2020 Golden Globes Roman Griffin Davis Getty Images 2020 Golden Globes Helen Mirren Getty Images 2020 Golden Globes Cate Blanchett Getty Images 2020 Golden Globes Lee Jeong-eun, Jo Yeo-jeong and Song Kang-ho Getty Images 2020 Golden Globes Lucy Boynton and Rami Malek Getty Images 2020 Golden Globes Barry Jenkins and Lulu Wang Getty Images 2020 Golden Globes Wesley Snipes Getty Images 1 of 105 Advertisement"
  },
  {
    "url": "http://www.fandango.com/freemovietickets/",
    "title": "Free Movie Tickets - Special Offers & Coupons - Discount Movie Tickets | Fandango",
    "description": "A Message to Our Movie Fans | | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities FIND THEATERS + MOVIE TIMES NEAR Featured Movie News Explore More Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC Stubs, Cinemark Movie Rewards and Regal Crown Club when you link accounts. Fandango Credits We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? FREE MOVIE TICKETS AND SPECIAL OFFERS Special Offers"
  },
  {
    "url": "https://www.fandango.com/account/mypurchases",
    "title": "My Fandango - Fandango Account - Fandango",
    "description": "Screen Reader Users: To optimize your experience with your screen reading software, please use our Flixster.com website, which has the same tickets as our Fandango.com and MovieTickets.com websites Don't have a Fandango VIP Account? Level up your movie life with Fandango VIP: Buy Movies. Get Movies. Insider Perks Partner Rewards Fandango Credits FANDANGOVIP Email Address Password This site is protected by reCAPTCHA and the Google and apply. Sign in with Google Sign in with Facebook We respect your privacy and will never post without your permission."
  },
  {
    "url": "https://www.fandango.com/account/joinnow?from=https%3a%2f%2fwww.fandango.com%2faccount%2fmypurchases",
    "title": "My Fandango - Fandango Account - Fandango",
    "description": "Screen Reader Users: To optimize your experience with your screen reading software, please use our Flixster.com website, which has the same tickets as our Fandango.com and MovieTickets.com websites Already have a Fandango VIP Account? Level up your movie life with Fandango VIP: Buy Movies. Get Movies. Insider Perks Partner Rewards Fandango Credits JOIN FANDANGOVIP (And become eligible for VIP+ Points) (And become eligible for VIP+ Points) First Name Email Address Password Use 8 or more characters with a letter and a number or symbol. No more than 3 of the same character in a row. Confirm Password By creating an account, you agree to the and the , and to receive email from Fandango. Join with Google Join with Facebook We respect your privacy and will never post without your permission."
  },
  {
    "url": "https://policies.google.com/privacy",
    "title": "Privacy Policy – Privacy & Terms – Google",
    "description": "Privacy PolicyPrivacy & TermsPrivacy PolicyGoogle Privacy PolicyWhen you use our services, you’re trusting us with your information. We understand this is a big responsibility and work hard to protect your information and put you in control.This Privacy Policy is meant to help you understand what information we collect, why we collect it, and how you can update, manage, export, and delete your information.Effective March 31, 2020 | | ContentsWe build a range of services that help millions of people daily to explore and interact with the world in new ways. Our services include:Google apps, sites, and devices, like Search, YouTube, and Google HomePlatforms like the Chrome browser and Android operating systemProducts that are integrated into third-party apps and sites, like ads and embedded Google MapsYou can use our services in a variety of ways to manage your privacy. For example, you can sign up for a Google Account if you want to create and manage content like emails and photos, or see more relevant search results. And you can use many Google services when you’re signed out or without creating an account at all, like searching on Google or watching YouTube videos. You can also choose to browse the web privately using Chrome in Incognito mode. And across our services, you can adjust your privacy settings to control what we collect and how your information is used.To help explain things as clearly as possible, we’ve added examples, explanatory videos, and definitions for . And if you have any questions about this Privacy Policy, you can .Information Google collectsWe want you to understand the types of information we collect as you use our servicesWe collect information to provide better services to all our users — from figuring out basic stuff like which language you speak, to more complex things like which , , or which YouTube videos you might like. The information Google collects, and how that information is used, depends on how you use our services and how you manage your privacy controls.When you’re not signed in to a Google Account, we store the information we collect with tied to the browser, application, or you’re using. This helps us do things like maintain your language preferences across browsing sessions.When you’re signed in, we also collect information that we store with your Google Account, which we treat as .Things you create or provide to usWhen you create a Google Account, you provide us with that includes your name and a password. You can also choose to add a or to your account. Even if you aren’t signed in to a Google Account, you might choose to provide us with information — like an email address to receive updates about our services.We also collect the content you create, upload, or receive from others when using our services. This includes things like email you write and receive, photos and videos you save, docs and spreadsheets you create, and comments you make on YouTube videos.Information we collect as you use our servicesYour apps, browsers & devicesWe collect information about the apps, browsers, and you use to access Google services, which helps us provide features like automatic product updates and dimming your screen if your battery runs low.The information we collect includes , browser type and settings, device type and settings, operating system, mobile network information including carrier name and phone number, and application version number. We also collect information about the interaction of your apps, browsers, and devices with our services, including , crash reports, system activity, and the date, time, and of your request.We collect this information when a Google service on your device contacts our servers — for example, when you install an app from the Play Store or when a service checks for automatic updates. If you’re using an , your device periodically contacts Google servers to provide information about your device and connection to our services. This information includes things like your device type, carrier name, crash reports, and which apps you've installed.Your activityWe collect information about your activity in our services, which we use to do things like recommend a YouTube video you might like. The activity information we collect may include:Terms you search forVideos you watchVoice and audio information when you use audio featuresPurchase activityPeople with whom you communicate or share contentActivity on third-party sites and apps that use our servicesChrome browsing history you’ve If you use our , we may collect telephony log information like your phone number, calling-party number, receiving-party number, forwarding numbers, time and date of calls and messages, duration of calls, routing information, and types of calls.You can visit your Google Account to find and manage activity information that’s saved in your account.Your location informationWe collect information about your location when you use our services, which helps us offer features like driving directions for your weekend getaway or showtimes for movies playing near you.Your location can be determined with varying degrees of accuracy by:GPS, such as Wi-Fi access points, cell towers, and Bluetooth-enabled devicesThe types of location data we collect depend in part on your device and account settings. For example, you can using the device’s settings app. You can also turn on if you want to create a private map of where you go with your signed-in devices.In some circumstances, Google also collects information about you from . For example, if your name appears in your local newspaper, Google’s Search engine may index that article and display it to other people if they search for your name. We may also collect information about you from trusted partners, including marketing partners who provide us with information about potential customers of our business services, and security partners who provide us with information to . We also receive information from advertisers to provide .We use various technologies to collect and store information, including , , local storage, such as or , databases, and .Why Google collects dataWe use data to build better servicesWe use the information we collect from all our services for the following purposes:Provide our servicesWe use your information to , like processing the terms you search for in order to return results or helping you share content by suggesting recipients from your contacts.Maintain & improve our servicesWe also use your information to , such as tracking outages or troubleshooting issues that you report to us. And we use your information to to our services — for example, understanding which search terms are most frequently misspelled helps us improve spell-check features used across our services.Develop new servicesWe use the information we collect in existing services to help us develop new ones. For example, understanding how people organized their photos in Picasa, Google’s first photos app, helped us design and launch Google Photos.Provide personalized services, including content and adsWe use the information we collect to customize our services for you, including providing recommendations, personalized content, and . For example, provides security tips adapted to how you use Google products. And Google Play uses information like apps you’ve already installed and videos you’ve watched on YouTube to suggest new apps you might like.Depending on your settings, we may also show you based on your interests. For example, if you search for “mountain bikes,” you may see an ad for sports equipment when you’re browsing a site that shows ads served by Google. You can control what information we use to show you ads by visiting your ad settings.We don’t show you personalized ads based on , such as race, religion, sexual orientation, or health.We don’t share information that personally identifies you with advertisers, such as your name or email, unless you ask us to. For example, if you see an ad for a nearby flower shop and select the “tap to call” button, we’ll connect your call and may share your phone number with the flower shop.Measure performanceWe use data for analytics and measurement to understand how our services are used. For example, we analyze data about your visits to our sites to do things like optimize product design. And we also use data about the ads you interact with to help advertisers understand the performance of their ad campaigns. We use a variety of tools to do this, including Google Analytics. When you visit sites that use Google Analytics, Google and a Google Analytics customer about your activity from that site with activity from other sites that use our ad services.Communicate with youWe use information we collect, like your email address, to interact with you directly. For example, we may send you a notification if we detect suspicious activity, like an attempt to sign in to your Google Account from an unusual location. Or we may let you know about upcoming changes or improvements to our services. And if you contact Google, we’ll keep a record of your request in order to help solve any issues you might be facing.Protect Google, our users, and the publicWe use information to help improve the of our services. This includes detecting, preventing, and responding to fraud, abuse, security risks, and technical issues that could harm Google, our users, or the public.We use different technologies to process your information for these purposes. We use automated systems that analyze your content to provide you with things like customized search results, personalized ads, or other features tailored to how you use our services. And we analyze your content to help us such as spam, malware, and illegal content. We also use to recognize patterns in data. For example, Google Translate helps people communicate across languages by detecting common language patterns in phrases you ask it to translate.We may among our services and across your devices for the purposes described above. For example, if you watch videos of guitar players on YouTube, you might see an ad for guitar lessons on a site that uses our ad products. Depending on your account settings, may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.If other users already have your email address or other information that identifies you, we may show them your publicly visible Google Account information, such as your name and photo. This helps people identify an email coming from you, for example.We’ll ask for your consent before using your information for a purpose that isn’t covered in this Privacy Policy.Your privacy controlsYou have choices regarding the information we collect and how it's usedThis section describes key controls for managing your privacy across our services. You can also visit the , which provides an opportunity to review and adjust important privacy settings. In addition to these tools, we also offer specific privacy settings in our products — you can learn more in our .Managing, reviewing, and updating your informationWhen you’re signed in, you can always review and update information by visiting the services you use. For example, Photos and Drive are both designed to help you manage specific types of content you’ve saved with Google.We also built a place for you to review and control information saved in your Google Account. Your includes:Privacy controlsActivity ControlsDecide what types of activity you’d like saved in your account. For example, you can turn on Location History if you want traffic predictions for your daily commute, or you can save your YouTube Watch History to get better video suggestions.Ad settingsManage your preferences about the ads shown to you on Google and on sites and apps that to show ads. You can modify your interests, choose whether your personal information is used to make ads more relevant to you, and turn on or off certain advertising services.About youControl what others see about you across Google services.Shared endorsementsChoose whether your name and photo appear next to your activity, like reviews and recommendations, that appear in ads.Information you shareIf you’re a G Suite user, control whom you share information with through your account on Google+.Ways to review & update your informationMy ActivityMy Activity allows you to review and control data that’s created when you use Google services, like searches you’ve done or your visits to Google Play. You can browse by date and by topic, and delete part or all of your activity.Google DashboardGoogle Dashboard allows you to manage information associated with specific products.Your personal informationManage your contact information, such as your name, email, and phone number.When you’re signed out, you can manage information associated with your browser or device, including:Signed-out search personalization: whether your search activity is used to offer you more relevant results and recommendations.YouTube settings: Pause and delete your and your .Ad Settings: your preferences about the ads shown to you on Google and on sites and apps that partner with Google to show ads.Exporting, removing & deleting your informationYou can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.You can also from specific Google services based on applicable law.To delete your information, you can:Delete your content from Search for and then delete specific items from your account using , including your information associated with those productsAnd finally, allows you to give someone else access to parts of your Google Account in case you’re unexpectedly unable to use your account.There are other ways to control the information Google collects whether or not you’re signed in to a Google Account, including:Browser settings: For example, you can configure your browser to indicate when Google has set a in your browser. You can also configure your browser to block all cookies from a specific domain or all domains. But remember that our services , for things like remembering your language preferences.Device-level settings: Your device may have controls that determine what information we collect. For example, you can on your Android device.Sharing your informationWhen you share your informationMany of our services let you share information with other people, and you have control over how you share. For example, you can share videos on YouTube publicly or you can decide to keep your videos private. Remember, when you share information publicly, your content may become accessible through search engines, including Google Search.When you’re signed in and interact with some Google services, like leaving comments on a YouTube video or reviewing an app in Play, your name and photo appear next to your activity. We may also display this information in .When Google shares your informationWe do not share your personal information with companies, organizations, or individuals outside of Google except in the following cases:With your consentWe’ll share personal information outside of Google when we have your consent. For example, if you through a booking service, we’ll get your permission before sharing your name or phone number with the restaurant. We’ll ask for your explicit consent to share any .With domain administratorsIf you’re a student or work for an organization that uses Google services (like G Suite), your and resellers who manage your account will have access to your Google Account. They may be able to:Access and retain information stored in your account, like your emailView statistics regarding your account, like how many apps you installChange your account passwordSuspend or terminate your account accessReceive your account information in order to satisfy applicable law, regulation, legal process, or enforceable governmental requestRestrict your ability to delete or edit your information or your privacy settingsFor external processingWe provide personal information to our and other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures. For example, we use service providers to help us with customer support.For legal reasonsWe will share personal information outside of Google if we have a good-faith belief that access, use, preservation, or disclosure of the information is reasonably necessary to:Meet any applicable law, regulation, . We share information about the number and type of requests we receive from governments in our .Enforce applicable Terms of Service, including investigation of potential violations.Detect, prevent, or otherwise address fraud, security, or technical issues.Protect against harm to the rights, property or safety of Google, our users, or the public as required or permitted by law.We may share publicly and with our partners — like publishers, advertisers, developers, or rights holders. For example, we share information publicly to about the general use of our services. We also allow to collect information from your browser or device for advertising and measurement purposes using their own cookies or similar technologies.If Google is involved in a merger, acquisition, or sale of assets, we’ll continue to ensure the confidentiality of your personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.Keeping your information secureWe build security into our services to protect your informationAll Google products are built with strong security features that continuously protect your information. The insights we gain from maintaining our services help us detect and automatically block security threats from ever reaching you. And if we do detect something risky that we think you should know about, we’ll notify you and help guide you through steps to stay better protected.We work hard to protect you and Google from unauthorized access, alteration, disclosure, or destruction of information we hold, including:We use encryption to keep your data private while in transitWe offer a range of security features, like , Security Checkup, and to help you protect your accountWe review our information collection, storage, and processing practices, including physical security measures, to prevent unauthorized access to our systemsWe restrict access to personal information to Google employees, contractors, and agents who need that information in order to process it. Anyone with this access is subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.Exporting & deleting your informationYou can export a copy of your information or delete it from your Google Account at any timeYou can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.To delete your information, you can:Delete your content from Search for and then delete specific items from your account using , including your information associated with those productsRetaining your informationWe retain the data we collect for different periods of time depending on what it is, how we use it, and how you configure your settings:Some data you can delete whenever you like, such as the content you create or upload. You can also delete saved in your account, or after a set period of time.Other data is deleted or anonymized automatically after a set period of time, such as in server logs.We keep some data until you delete your Google Account, such as information about how often you use our services.And some data we retain for longer periods of time when necessary for legitimate business or legal purposes, such as security, fraud and abuse prevention, or financial record-keeping.When you delete data, we follow a deletion process to make sure that your data is safely and completely removed from our servers or retained only in anonymized form. We try to ensure that our services protect information from accidental or malicious deletion. Because of this, there may be delays between when you delete something and when copies are deleted from our active and backup systems.You can read more about Google’s , including how long it takes us to delete your information.Compliance & cooperation with regulatorsWe regularly review this Privacy Policy and make sure that we process your information in ways that comply with it.Data transfersWe maintain and your information may be processed on servers located outside of the country where you live. Data protection laws vary among countries, with some providing more protection than others. Regardless of where your information is processed, we apply the same protections described in this policy. We also comply with certain relating to the transfer of data, such as the EU-U.S. and Swiss-U.S. Privacy Shield Frameworks.When we receive formal written complaints, we respond by contacting the person who made the complaint. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of your data that we cannot resolve with you directly.About this policyWhen this policy appliesThis Privacy Policy applies to all of the services offered by Google LLC and its , including YouTube, Android, and services offered on third-party sites, such as advertising services. This Privacy Policy doesn’t apply to services that have separate privacy policies that do not incorporate this Privacy Policy.This Privacy Policy doesn’t apply to:The information practices of other companies and organizations that advertise our servicesServices offered by other companies or individuals, including products or sites that may include Google services, be displayed to you in search results, or be linked from our servicesChanges to this policyWe change this Privacy Policy from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We always indicate the date the last changes were published and we offer access to for your review. If changes are significant, we’ll provide a more prominent notice (including, for certain services, email notification of Privacy Policy changes).Related privacy practicesSpecific Google servicesThe following privacy notices provide additional information about some Google services:Other useful resourcesThe following links highlight useful resources for you to learn more about our practices and privacy settings. is home to many of the settings you can use to manage your account guides you through key privacy settings for your Google Account helps you learn more about our built-in security, privacy controls, and tools to help set digital ground rules for your family online provides more context regarding this Privacy Policy and our Terms of Service includes more information about:Technologies used for to recognize things like faces in photosKey termsAffiliatesAn affiliate is an entity that belongs to the Google group of companies, including the following companies that provide consumer services in the EU: Google Ireland Limited, Google Commerce Ltd, Google Payment Corp, and Google Dialer Inc. Learn more about the .AlgorithmA process or set of rules followed by a computer in performing problem-solving operations.Application data cacheAn application data cache is a data repository on a device. It can, for example, enable a web application to run without an internet connection and improve the performance of the application by enabling faster loading of content.Browser web storageBrowser web storage enables websites to store data in a browser on a device. When used in \"local storage\" mode, it enables data to be stored across sessions. This makes data retrievable even after a browser has been closed and reopened. One technology that facilitates web storage is HTML 5.CookiesA cookie is a small file containing a string of characters that is sent to your computer when you visit a website. When you visit the site again, the cookie allows that site to recognize your browser. Cookies may store user preferences and other information. You can configure your browser to refuse all cookies or to indicate when a cookie is being sent. However, some website features or services may not function properly without cookies. Learn more about and how Google uses data, including cookies, .DeviceA device is a computer that can be used to access Google services. For example, desktop computers, tablets, smart speakers, and smartphones are all considered devices.Google AccountYou may access some of our services by signing up for a and providing us with some personal information (typically your name, email address, and a password). This account information is used to authenticate you when you access Google services and protect your account from unauthorized access by others. You can edit or delete your account at any time through your Google Account settings.IP addressEvery device connected to the Internet is assigned a number known as an Internet protocol (IP) address. These numbers are usually assigned in geographic blocks. An IP address can often be used to identify the location from which a device is connecting to the Internet.Non-personally identifiable informationThis is information that is recorded about users so that it no longer reflects or references an individually-identifiable user.Personal informationThis is information that you provide to us which personally identifies you, such as your name, email address, or billing information, or other data that can be reasonably linked to such information by Google, such as information we associate with your Google Account.Pixel tagA pixel tag is a type of technology placed on a website or within the body of an email for the purpose of tracking certain activity, such as views of a website or when an email is opened. Pixel tags are often used in combination with cookies.Referrer URLA Referrer URL (Uniform Resource Locator) is information transmitted to a destination webpage by a web browser, typically when you click a link to that page. The Referrer URL contains the URL of the last webpage the browser visited.Sensitive personal informationThis is a particular category of personal information relating to topics such as confidential medical facts, racial or ethnic origins, political or religious beliefs, or sexuality.Server logsLike most websites, our servers automatically record the page requests made when you visit our sites. These “server logs” typically include your web request, Internet Protocol address, browser type, browser language, the date and time of your request, and one or more cookies that may uniquely identify your browser.A typical log entry for a search for “cars” looks like this:123.45.67.89 - 25/Mar/2003 10:15:32 -http://www.google.com/search?q=cars -Firefox 1.0.7; Windows NT 5.1 -740674ce2123e969123.45.67.89 is the Internet Protocol address assigned to the user by the user’s ISP. Depending on the user’s service, a different address may be assigned to the user by their service provider each time they connect to the Internet.25/Mar/2003 10:15:32 is the date and time of the query.http://www.google.com/search?q=cars is the requested URL, including the search query.Firefox 1.0.7; Windows NT 5.1 is the browser and operating system being used.740674ce2123a969 is the unique cookie ID assigned to this particular computer the first time it visited Google. (Cookies can be deleted by users. If the user has deleted the cookie from the computer since the last time they’ve visited Google, then it will be the unique cookie ID assigned to their device the next time they visit Google from that particular device).Unique identifiersA unique identifier is a string of characters that can be used to uniquely identify a browser, app, or device. Different identifiers vary in how permanent they are, whether they can be reset by users, and how they can be accessed.Unique identifiers can be used for various purposes, including security and fraud detection, syncing services such as your email inbox, remembering your preferences, and providing personalized advertising. For example, unique identifiers stored in cookies help sites display content in your browser in your preferred language. You can configure your browser to refuse all cookies or to indicate when a cookie is being sent. Learn more about .On other platforms besides browsers, unique identifiers are used to recognize a specific device or app on that device. For example, a unique identifier such as the Advertising ID is used to provide relevant advertising on Android devices, and can be in your device’s settings. Unique identifiers may also be incorporated into a device by its manufacturer (sometimes called a universally unique ID or UUID), such as the IMEI-number of a mobile phone. For example, a device’s unique identifier can be used to customize our service to your device or analyze device issues related to our services.Additional Contextads you’ll find most usefulFor example, if you watch videos about baking on YouTube, you may see more ads that relate to baking as you browse the web. We also may use your IP address to determine your approximate location, so that we can serve you ads for a nearby pizza delivery service if you search for “pizza.” Learn more and .advertising and research services on their behalfFor example, advertisers may upload data from their loyalty-card programs so that they can better understand the performance of their ad campaigns. We only provide aggregated reports to advertisers that don’t reveal information about individual people.Android device with Google appsAndroid devices with Google apps include devices sold by Google or one of our partners and include phones, cameras, vehicles, wearables, and televisions. These devices use Google Play Services and other pre-installed apps that include services like Gmail, Maps, your phone’s camera and phone dialer, text-to-speech conversion, keyboard input, and security features.combine the information we collectSome examples of how we combine the information we collect include:When you’re signed in to your Google Account and search on Google, you can see search results from the public web, along with relevant information from the content you have in other Google products, like Gmail or Google Calendar. This can include things like the status of your upcoming flights, restaurant, and hotel reservations, or your photos. If you have communicated with someone via Gmail and want to add them to a Google Doc or an event in Google Calendar, Google makes it easy to do so by autocompleting their email address when you start to type in their name. This feature makes it easier to share things with people you know. The Google app can use data that you have stored in other Google products to show you personalized content, depending on your settings. For example, if you have searches stored in your Web & App Activity, the Google app can show you news articles and other information about your interests, like sports scores, based your activity. If you link your Google Account to your Google Home, you can manage your information and get things done through the Google Assistant. For example, you can add events to your Google Calendar or get your schedule for the day, ask for status updates on your upcoming flight, or send information like driving directions to your phone. customized search resultsFor example, when you’re signed in to your Google Account and have the Web & App Activity control enabled, you can get more relevant search results that are based on your previous searches and activity from other Google services. You can . You may also get customized search results even when you’re signed out. If you don’t want this level of search customization, you can or turn off .deliver our servicesExamples of how we use your information to deliver our services include:We use the IP address assigned to your device to send you the data you requested, such as loading a YouTube videoWe use unique identifiers stored in cookies on your device to help us authenticate you as the person who should have access to your Google AccountPhotos and videos you upload to Google Photos are used to help you create albums, animations, and other creations that you can share. A flight confirmation email you receive may be used to create a “check-in” button that appears in your GmailWhen you purchase services or physical goods from us, you may provide us information like your shipping address or delivery instructions. We use this information for things like processing, fulfilling, and delivering your order, and to provide support in connection with the product or service you purchase.detect abuseWhen we detect spam, malware, illegal content, and other forms of abuse on our systems in violation of our policies, we may disable your account or take other appropriate action. In certain circumstances, we may also report the violation to appropriate authorities.devicesFor example, we can use information from your devices to help you decide which device you’d like to use to install an app or view a movie you buy from Google Play. We also use this information to help protect your account.ensure and improveFor example, we analyze how people interact with advertising to improve the performance of our ads.ensure our services are working as intendedFor example, we continuously monitor our systems to look for problems. And if we find something wrong with a specific feature, reviewing activity information collected before the problem started allows us to fix things more quickly.Information about things near your deviceIf you use Google’s Location services on Android, we can improve the performance of apps that rely on your location, like Google Maps. If you use Google’s Location services, your device sends information to Google about its location, sensors (like accelerometer), and nearby cell towers and Wi-Fi access points (like MAC address and signal strength). All these things help to determine your location. You can use your device settings to enable Google Location services. legal process, or enforceable governmental requestLike other technology and communications companies, Google regularly receives requests from governments and courts around the world to disclose user data. Respect for the privacy and security of data you store with Google underpins our approach to complying with these legal requests. Our legal team reviews each and every request, regardless of type, and we frequently push back when a request appears to be overly broad or doesn’t follow the correct process. Learn more in our .make improvementsFor example, we use cookies to analyze how people interact with our services. And that analysis can help us build better products. For example, it may help us discover that it’s taking people too long to complete a certain task or that they have trouble finishing steps at all. We can then redesign that feature and improve the product for everyone.may link informationGoogle Analytics relies on first-party cookies, which means the cookies are set by the Google Analytics customer. Using our systems, data generated through Google Analytics can be linked by the Google Analytics customer and by Google to third-party cookies that are related to visits to other websites. For example, an advertiser may want to use its Google Analytics data to create more relevant ads, or to further analyze its traffic. partner with GoogleThere are over 2 million non-Google websites and apps that partner with Google to show ads. payment informationFor example, if you add a credit card or other payment method to your Google Account, you can use it to buy things across our services, like apps in the Play Store. We may also ask for other information, like a business tax ID, to help process your payment. In some cases, we may also need to verify your identity and may ask you for information to do this.We may also use payment information to verify that you meet age requirements, if, for example, you enter an incorrect birthday indicating you’re not old enough to have a Google Account. personalized adsYou may also see personalized ads based on information from the advertiser. If you shopped on an advertiser's website, for example, they can use that visit information to show you ads. phone numberIf you add your phone number to your account, it can be used for different purposes across Google services, depending on your settings. For example, your phone number can be used to help you access your account if you forget your password, help people find and connect with you, and make the ads you see more relevant to you. protect against abuseFor example, information about security threats can help us notify you if we think your account has been compromised (at which point we can help you take steps to protect your account).publicly accessible sourcesFor example, we may collect information that’s publicly available online or from other public sources to help train Google’s language models and build features like Google Translate.rely on cookies to function properlyFor example, we use a cookie called ‘lbcs’ that makes it possible for you to open many Google Docs in one browser. Blocking this cookie would prevent Google Docs from working as expected. safety and reliabilitySome examples of how we use your information to help keep our services safe and reliable include:Collecting and analyzing IP addresses and cookie data to protect against automated abuse. This abuse takes many forms, such as sending spam to Gmail users, stealing money from advertisers by fraudulently clicking on ads, or censoring content by launching a Distributed Denial of Service (DDoS) attack.The “last account activity” feature in Gmail can help you find out if and when someone accessed your email without your knowledge. This feature shows you information about recent activity in Gmail, such as the IP addresses that accessed your mail, the associated location, and the date and time of access. sensitive categoriesWhen showing you personalized ads, we use topics that we think might be of interest to you based on your activity. For example, you may see ads for things like \"Cooking and Recipes\" or \"Air Travel.” We don’t use topics or show personalized ads based on sensitive categories like race, religion, sexual orientation, or health. And we that use our services.Sensor data from your deviceYour device may have sensors that can be used to better understand your location and movement. For example, an accelerometer can be used to determine your speed and a gyroscope to figure out your direction of travel.servers around the worldFor example, we operate data centers located to help keep our products continuously available for users.services to make and receive calls or send and receive messagesExamples of these services include:Google Hangouts, for making domestic and international callsGoogle Voice, for making calls, sending text messages, and managing voicemailGoogle Fi, for a phone planshow trendsWhen lots of people start searching for something, it can provide useful information about particular trends at that time. Google Trends samples Google web searches to estimate the popularity of searches over a certain period of time and shares those results publicly in aggregated terms. specific Google servicesFor example, you can delete from Blogger or from Google Sites. You can also delete you’ve left on apps, games, and other content in the Play Store.specific partnersFor example, we allow YouTube creators and advertisers to work with measurement companies to learn about the audience of their YouTube videos or ads, using cookies or similar technologies. Another example is merchants on our shopping pages, who use cookies to understand how many different people see their product listings. about these partners and how they use your information.synced with your Google AccountYour Chrome browsing history is only saved to your account if you’ve enabled Chrome synchronization with your Google Account. the people who matter most to you onlineFor example, when you type an address in the To, Cc, or Bcc field of an email you're composing, Gmail will suggest addresses based on the people you .third partiesFor example, we process your information to report use statistics to rights holders about how their content was used in our services. We may also process your information if people search for your name and we display search results for sites containing publicly available information about you.Views and interactions with content and adsFor example, we collect information about views and interactions with ads so we can provide aggregated reports to advertisers, like telling them whether we served their ad on a page and whether the ad was likely seen by a viewer. We may also measure other interactions, such as how you move your mouse over an ad or if you interact with the page on which the ad appears.your activity on other sites and appsThis activity might come from your use of Google services, like from syncing your account with Chrome or your visits to sites and apps that partner with Google. Many websites and apps partner with Google to improve their content and services. For example, a website might use our advertising services (like AdSense) or analytics tools (like Google Analytics), or it might embed other content (such as videos from YouTube). These services may share information about your activity with Google and, depending on your and the products in use (for instance, when a partner uses Google Analytics in conjunction with our advertising services), this data may be associated with your personal information. about how Google uses data when you use our partners' sites or apps.Change language:AfrikaansBahasa IndonesiaBahasa MelayuCatalàČeštinaDanskDeutschEestiEnglishEnglish (United Kingdom)EspañolEspañol (Latinoamérica)EuskaraFilipinoFrançaisFrançais (Canada)GalegoHrvatskiIsizuluÍslenskaItalianoKiswahiliLatviešuLietuviųMagyarNederlandsNorskPolskiPortuguês (Brasil)Português (Portugal)RomânăSlovenčinaSlovenščinaSuomiSvenskaTiếng ViệtTürkçeΕλληνικάБългарскиРусскийСрпскиУкраїнська‫עברית‬‫اردو‬‫العربية‬‫فارسی‬አማርኛमराठीहिन्दीবাংলাગુજરાતીதமிழ்తెలుగుಕನ್ನಡമലയാളംไทย한국어中文 (香港)中文（简体中文）中文（繁體中文）日本語"
  },
  {
    "url": "https://www.fandango.com/",
    "title": "Movie Tickets & Movie Times | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Movie Tickets and Times Now Playing & Coming Soon Fri, Feb 21 Previous Next"
  },
  {
    "url": "http://www.fandango.com/movie-ticket-policy",
    "title": "Ticket Policy | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Ticket Policy Ticket Policy Privacy Policy Terms and Policies Terms of Use Ticket Policy Promo Code Policy Gift Card Terms Cookies and Tracking FandangoNOW Policy VIP+ Program Terms This Ticket Policy (this \"Ticket Policy\") was last updated on: June 12, 2019. When we say \"our\", \"us\", or \"we\" or “Fandango” in this Ticket Policy, we mean Fandango Media, LLC or its subsidiaries, including, but not limited to, MovieTickets.com, LLC. When we say \"Services\" or \"Site\" in this Ticket Policy, we mean websites operating under the Fandango, Rotten Tomatoes, Flixster, Movieclips, Movies.com, Activaterewards.com and MovieTickets.com brands, or other brands that we own, as well as those of our websites, applications, emails and other communications that link to or reference this Ticket Policy or other Terms and Policies, or the other services provided through any of these means. This Ticket Policy is subject to, and shall also include, the other Terms and Policies. NOTICE OF ARBITRATION PROVISIONS: Your purchase of movie tickets or other use of our Services is subject to binding individual arbitration of any disputes which may arise, as provided in the . Please read the arbitration provisions carefully and do not purchase tickets from us or otherwise use our Services if you are unwilling to arbitrate any disputes you may have with us as provided below. Our goal is to make your movie-going experience as easy and enjoyable as possible. Our Ticket Policy is designed to provide you with much of the information you need. Please take a minute to read the following: 1. REFUNDS AND EXCHANGES Refunds and exchanges of movie ticket(s) are available in certain limited circumstances. Movie tickets purchased through the Services include a non-refundable Convenience Fee. Before purchasing your movie ticket(s) we urge you to confirm the title, time, location and quantity of tickets for the movie you wish to see. A refund will return the value of the movie ticket(s) you purchased using the Services to the method of payment used for the transaction, minus the per-ticket Convenience Fee and subject to certain eligibility restrictions as described below. Amounts paid with gift cards will not be refunded; instead, amounts paid with gift cards will be credited for future ticket purchases. If a promo code is used to purchase a ticket, the amount paid with the promo code will be forfeited, and will not be refunded. In certain cases, special promotions will be offered for free or discounted tickets or Convenience Fees, even without the use of a promo code; in such cases, such free (or discounted portions of) tickets or Convenience Fees will not be refunded. Instead of a refund, you may wish to exchange your movie ticket(s) for another movie and/or show time. Exchanging your movie ticket(s) will allow you to keep the movie ticket price and the per-ticket Convenience Fee as a stored credit in your account, subject to certain eligibility restrictions as described below. Any stored credit in your account will automatically be applied to your next Fandango movie ticket purchase made through the Services using your account. Amounts paid with gift cards can be used for exchanges. If a promo code is used to purchase a ticket, the amount paid with the promo code will be forfeited, and cannot be used for an exchange. In certain cases, special promotions will be offered for free or discounted tickets or Convenience Fees, even without the use of a promo code; in such cases, such free (or discounted portions of) tickets or Convenience Fees cannot be used for an exchange. You may initiate a refund or exchange using an online automated tool accessible via your Fandango account available through the website, mobile phone apps, or your purchase confirmation email. However, in certain events such as when the total value of your refund or exchange exceeds Fandango's self-service refunds and exchanges limit and/or your purchase includes the use of a Fandango gift card or promo code, you may be directed to Fandango Customer Service to complete your refund or exchange. Please note that once you have received an exchange, Fandango credits may be exchanged for other credit but are no longer eligible for a refund back to your credit card or other payment type. You are eligible for a refund (minus any Convenience Fees) or exchange only if you: (i) are seeking a refund or exchange of an entire order (i.e. no partial refunds or exchanges), (ii) initiated the refund or exchange within the refunds and exchanges eligibility period prior to show time for the earliest show time of any of the movie tickets included in your purchase, (iii) used a credit card, Venmo, PayPal or other qualifying digital wallet, or a gift card (except that gift cards purchases can be exchanged but not refunded) to pay for the transaction, and (iv) already have a Fandango account or you create one during the initiation of a refund or exchange. You may need to visit the theater to request a refund or exchange in certain circumstances, including but not limited to those instances where any portion of your payment was made using a theater rewards or loyalty card or a theater gift card. In certain circumstances, a theater may not provide a refund or exchange, so please confirm with your theater whether a refund or exchange is available for your order. You may additionally be subject to your digital wallet providers’ individual refund policies if you used a digital wallet to make a purchase. Fandango reserves the right to prohibit the refund or exchange of a movie ticket purchased or otherwise acquired through a subscription, membership or loyalty program. Additionally, even where Fandango allows such a refund or exchange, Fandango shall have the right to provide the refund or credit to the operator of such subscription, membership or loyalty program instead of to you. If Fandango does so, Fandango encourages you to contact the operator of that subscription, membership or loyalty program for any customer service enquiries. 2. PAYMENT METHODS Fandango accepts a variety of payment methods, which may include Visa, MasterCard, American Express, Discover/Novus, Venmo and PayPal and certain other digital wallets. We also accept Promotional Codes and Gift Cards. We may also accept certain theater partners' gift cards for their theaters. All debit and credit cards must be issued in the United States of America, and Venmo, PayPal and other digital wallet accounts must be United States accounts. Fandango does not accept \"Single-Use\" card number security products. 3. RETRIEVING YOUR TICKETS Please read your online, email and/or mobile confirmation pages carefully, as they provide you with important information about retrieving your tickets that may be unique to your chosen theater. Please remember to bring your Print-at-Home ticket with barcode to the theater if you used this feature. If you can't print or don't have a printer, just take your confirmation number with you. However, if you have a Print-at-Home Bar-Coded Ticket, you should present it when you arrive at the theater. If you purchased a Mobile Ticket (mobile accessible barcode ticket), bring a mobile device capable of displaying the Mobile Ticket to the theater ticket-taker. 4. BE PREPARED TO PRESENT YOUR CREDIT CARD AND YOUR PICTURE ID If you elect to pick up your tickets at the theater, certain theaters may require that you present the actual credit card used to purchase tickets and the number printed on the card must match the number stored for your transaction. Also, you may be required to present your picture ID. 5. TICKET CONFIRMATION, MOVIE RATE-AND-REVIEW AND RELATIONSHIP E-MAILS As an integral part of your ticketing transaction with us, we may send you via e-mail and/or text a ticket confirmation following purchase explaining how to retrieve your tickets at the theater, and we may also send one or more subsequent invitations to rate-and-review the movie or other communications regarding your experience or relationship with us. Providing feedback via a rate-and-review or other e-mails is optional; if you do not wish to participate, just ignore or delete those messages. 6. PRICING, AVAILABILITY AND TAXES We sell tickets on behalf of theaters. We do not operate those theaters and we do not set ticket prices, determine show times, or control ticket availability or inventory. Sometimes, states or local jurisdictions may tax tickets, convenience fees or other fees. Prices displayed on the Site are inclusive of any such taxes, and reflect the “grossed-up” amounts. For example, you may see on the Site a ticket price of $10.80 for a theater selling a $10.00 ticket in a jurisdiction that has an 8% tax (in such a case, the theater may receive and retain the $10.00 and remit the $0.80 tax to the local taxing authority)—in such a case, we do not separately show on the Site these various components but instead simplify the display and show $10.80 as the ticket price. We display things in a similar way where there are taxes on convenience fees or on other fees—we would show the total amount that includes any such tax, and not show the tax separately. 7. PRIVACY As set forth in our , your use of the Services is governed by our . You agree to our collection, use and sharing of your information as set forth in the . As further set forth in our , the third-party web sites linked to or from the Service are not controlled by us, and we do not control their privacy policies. The personal data you choose to provide to third parties or that is collected by any third parties is not covered by the , and we encourage you to review the privacy policy of any company before submitting your personal information. 8. ARBITRATION We believe that arbitration is a faster, more convenient and less expensive way to resolve any disputes or disagreements that you may have with us. Therefore, pursuant to the , if you have any dispute or disagreement with us regarding (i) your use of or interaction with the Services, (ii) any movie ticket purchases or other purchases, transactions or relationships with us, or (iii) any data or information you may provide to us or that we may gather in connection with such use, interaction or transaction (collectively, \" Transactions or Relationships\"), you will not have the right to pursue a claim in court, or have a jury decide the claim and you will not have the right to bring or participate in any class action or similar proceeding in court or in arbitration. By using or interacting with the Services, or engaging in any other Transactions or Relationships with us, you agree to binding arbitration as provided in the . 9. CHANGES TO TICKET POLICY From time to time, we may revise this Ticket Policy. You can determine when this Ticket Policy was last revised by referring to the top of this page. Any changes to this Ticket Policy will become effective upon posting of the revised Ticket Policy on the Internet, accessible through the Services. By purchasing movie tickets or otherwise continuing to use Services following such changes, you will be deemed to have agreed to such changes. If you do not agree with the terms of this Ticket Policy, as it may be amended from time to time, please do not purchase movie tickets from us or continue using the Services. To the extent that an arbitrator or court of applicable jurisdiction determines that applying any changes to this Ticket Policy would render this an illusory or unenforceable contract, such changes shall be applicable on a prospective basis only, with respect to events or circumstances occurring after the date of such changes, to the extent necessary to avoid this Ticket Policy being deemed illusory or unenforceable. 10. TERMS OF USE Your purchase of movie tickets and other access to and use of the Services is also subject to the . If you have any questions about the information above, please ."
  },
  {
    "url": "http://www.fandango.com/policies/cookies-and-tracking/",
    "title": "Cookies and Tracking Technologies Information Center | Fandango",
    "description": "| | Now Playing Opening This Week = Limited Release Coming Soon Explore More Where are you located? Here are our top cities Find theaters + movie times near Featured Movie News Explore Content Buy Movies. Get Movies. Earn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies. Insider Perks Get your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore. Partner Rewards Collect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts. Refunds + Exchanges We know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime. (It only takes a few seconds to join) Already a Fandango VIP? Cookies and Tracking Technologies Information Center Cookies and Tracking Privacy Policy Terms and Policies Terms of Use Ticket Policy Promo Code Policy Gift Card Terms Cookies and Tracking FandangoNOW Policy VIP+ Program Terms | | Last updated: January 9, 2020 Fandango Media, LLC and its subsidiary companies, including the businesses operating under the Fandango, FandangoNOW, Rotten Tomatoes, Flixster, Movieclips, Movies.com, Activaterewards.com, Fandango FanShop, MovieTickets.com, or M-GO brands (“Fandango”, “we”, “our” or “us”) and those of our websites, applications, emails and other communications that link to or reference this policy (the “Services”), along with advertisers, advertising companies, consumer data companies and service providers, use a variety of technologies to learn more about how people use the Services. You can find out more about these technologies and how to control them in the information below. This Cookies Notice forms part of the , and if some of the terms used in here aren’t defined here, you may find definitions for them in the . NOTICE OF ARBITRATION PROVISIONS: Your use of the Services is subject to binding individual arbitration of any disputes which may arise, as provided in the . Please read the arbitration provisions carefully and do not purchase tickets from Fandango or otherwise use our Services if you are unwilling to arbitrate any disputes you may have with us as provided below. 1. WHAT ARE COOKIES AND HOW ARE THEY USED? Like many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated) including HTTP cookies, HTML5 and Flash local storage/ flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits. First party Cookies First party Cookies are placed by us (including through the use of third party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities. Third party Cookies Certain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or services. These third parties collect and use this information pursuant to their own privacy policies. Third party Cookies enable certain features or functionalities and advertising to be provided on the Services. The Services use the following types of first and third party Cookies for the purposes: Strictly Necessary Cookies: These Cookies are required for Service functionality, such as system administration and performance, to assist with fraud deterrence and security, and to enable purchasing capabilities. Because these Cookies are necessary, if you refuse them it will impact the functionality of the Services. Analytics and Performance Cookies: These Cookies collect data regarding your usage of our Services and other services. We and our third party vendors use these Cookies to perform analytics, to improve content and user experience, for statistical purposes, to recognize you across platforms and devices, to develop new services, and to improve the Services. Functional Cookies: These Cookies enable the Services to provide certain features such as determining if you are a first time visitor, remembering choices you have made (such as theaters or places in which you have previously expressed an interest), and assisting you with logging in following registration, including across platforms and devices and placing orders online. Data collected can also be used to select and deliver personalized content to you. Targeting Cookies: These Cookies are used to collect data about your browsing habits, your use of the Services and other services, your preferences, and your interaction with advertisements across platforms and devices in order to deliver content, including advertisements relevant to your interests. Third party sites and services also use these Cookies to deliver content, including advertisements relevant to your interests on the Services and third party services. Social Media Cookies: These Cookies are set by social media services on the Services to enable you to share our content with your friends and networks. These Cookies can track your online activity across the Services and other services and may impact the content and messages you see on other services you visit. We and third parties may associate Analytics and Performance Cookies, Functional Cookies, Targeting Cookies, and Social Media Cookies with other information we have about you. 2. COOKIE MANAGEMENT You can use the following methods to manage Cookies. In order to do so, you must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or if you delete your Cookies, you may need to use these opt-out tools again. Browser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on your device, you will need to manage your settings for each. Please click on any of the below browser links for instructions: If the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services. Analytics Provider Opt-Outs: To disable analytics Cookies you may use the browser controls discussed above, or for some of our providers, you may use their individual opt-out mechanisms: The above are examples of analytics providers, but this may not list all of them. In addition, we are not responsible for the effectiveness of any provider’s opt out mechanisms. Flash Local Storage: These Cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash Cookies need to be deleted in the storage section of your Flash Player Settings Manager. Targeted Advertising: Most third party advertisers offer a way to opt-out of their targeted advertising. For more information or to opt-out of receiving targeted advertising from participating third party advertisers, depending on your country of residence, please visit: You can also opt out of some of our advertising networks by visiting their opt-out pages: These are examples of our advertising providers, but this may not list all of them. In addition, we are not responsible for the effectiveness of any advertising provider’s opt out mechanisms. After you opt-out, you will still see advertisements, but they may not be as relevant to you. Mobile Settings: You may manage the collection of information for personalized advertising purposes, or the collection of location data, in mobile apps via the device’s settings. Cross-Device Tracking: If you would like to opt-out of our browser-based cross-device tracking for advertising purposes, you may do so by opting out using the various methods described above. You must opt out separately on each device and each browser that you use. For more information about cross-device matching please visit: the , or the . If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics. Consequences of Deactivation of all Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences. 3. CONTACT US For inquiries in relation to this Cookies Notice please contact us at or Fandango, ATTN: Legal Department, 407 N. Maple Drive, Suite 300, Beverly Hills, CA 90210. 4. CHANGES TO THIS NOTICE This Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising providers and associates use of Cookies."
  }
]